{"source": "https://support.medirecords.com/hc/en-us/articles/360000237155-Clinical-Drawer", "title": "Clinical Drawer", "body": "Clinical Drawer\n  The Clinical Drawer function allows you to use an anatomy image from our library to draw and annotate on. You also have the option to upload an image yourself to modify for the patient file. This tutorial will go through the various functions of the Clinical Drawer, and how to manage the drawings.\n\nWithin the patient record, click on the Clinical tab.\n\n\n\nClick on Clinical Drawings\n\nYou will be taken to the Clinical Drawings screen for that patient's clinical record. \n\nChecking the box next to a drawing will reveal a list of options. There is also the Filter and Search functions on the right as shown.\n\nSearch\n\nTo Search for a Clinical Drawing, click the Search box and type in a Keyword. \n\n\nPress Enter, and the system will display a list of the closest matches in the Comments field.\n\nCreate \nTo Create a New Clinical Drawing, click New Clinical Drawing to open the clinical drawer.\n  You will be brought to the Clinical Drawer window.\n\n\n\nThere are three categories of images in the Clinical Drawer.\n\nCustom\n\nImages that are uploaded to this category are different to the pre-loaded images.\n\nMiscellaneous\n\nImages that are uploaded to this category may not be for clinical relevance. \n\nExternal\n\nThese are where the anatomy images are stored. \n\nIn the interests of this tutorial, we will use an image from the External category to demonstrate\n\nSelect External. You will see numerous images to pick from here. For example:\n\n\n\nYou have a variety of tools to modify your drawing. In this case, we will draw a red circle on the toe.\n\n\n\nIf you need to clear any modifications, click on Clear Artboard. Note that this will clear ALL modifications made.\n\nClick Comments and type in any relevant clinical notes or comments. \n\nYou will also note the two tick-boxes underneath the drawing: checking the Add to Today's Notes tick-box will append the drawing in your current consultation. Furthermore, click the Confidential tick-box will make the drawing confidential (i.e. only you can see it).\n\nClick Save when you are finished.\n\n\n\nThe newly created clinical drawing will now be visible in the Clinical Drawings summary.\n\nOpen \nTo Open a Clinical Drawing, hover your mouse over the category of the drawing. When the cursor changes to a Finger Pointer, click the Name of the category.\n\n\nEdit \nTo edit a Clinical Drawing, click the tick-box next to the name to reveal a list of options. Click Edit to open the clinical drawer.\n\nWhen editing a drawing, the Location and Body Part cannot be altered. Editing is limited to the drawing Tools and Colours, and Clinical Notes/Comments.\nReview or edit the clinical drawing as required, and click Save to apply the changes.\nDelete\nTo delete a Clinical Drawing (or multiple), click the Tick-box next to the name to reveal a list of options and select Delete.\n \nClick Yes to acknowledge the drawing will be deleted.\n \nDeactivate/Reactivate \nTo deactivate a Clinical Drawing (or multiple), click the Tick-box next to the name to reveal a list of options. Click Status to reveal a drop-down list, and click Deactivate.\n\nNote: Deactivating a clinical drawing does not delete it. The drawing will be removed from the summary, and placed in the Inactive list, which can be located by using the Filter.\nTo activate a Clinical Drawing, switch to the list of Inactive drawings by using the Filter.\n\n\nClick the Tick-box next to the name to reveal a list of options. Click Status to reveal a drop-down list, and click Activate.\nPrint\n\nTo Print a Clinical Drawing, click the Tick-box next to the name to reveal a list of options. Click More, and then click Print to open a print preview.\nCheck to make sure the drawing is going to the right printer in Destination, select Layout and Colour if required, and then click Print.\n\nYou should now be able to use the Clinical Drawer function in your consultations. If this is not what you're looking for, head back to our knowledge base and search for another article.\nFor urgent assistance, please contact MediRecords support on 1300 103 903 during business hours."}