{"source": "https://support.medirecords.com/hc/en-us/articles/360000903515-How-Do-I-Apply-For-An-eRx-ID", "title": "How Do I Apply For An eRx ID?", "body": "eRx Configuration\nThis article will cover how to set up eRx (for e-prescribing) in MediRecords for the first time. To set up eRx, you will need to register yourself on the eRx website and add your HPI-O (Healthcare Organisation) certificate, and the certificate associated with the Health Identifier (HI) Service to your practice configuration settings.\nEach of these steps will be covered individually in this article.\n\neRx Registration\nBefore you can set up eRx in MediRecords, you will need to register yourself for e-prescribing on the eRx website.\nTo register, go to www.erx.com.au and click Register NOW in the right-hand corner of the page.\n\nWhere it says I am a Medical Practitioner click, Register.\nPrescriber Registration Step 1 - Minimum Requirements. You will need to meet all of the minimum requirements in order to proceed. Tick all boxes and click Next.\n\nWhen completing the form, remember to select MediRecords as your clinical software provider, if you do not select MediRecords as your software provider, this will cause a delay in the registration process.\nOnce you have completed and submitted your registration form, please allow 1 to 3 days for eRx to process the application.\n\nWhen the application is approved, you will be emailed your eRx ID and other necessary information in the setup. \n\nAdding the eRx Identification Number\nThe eRx ID must be added to your profile in MediRecords, in the Identifiers section of the User Settings.\n\nTo open User Settings, click More at the left panel of the page to reveal a drop-down list, and then click Settings.\n\nClick Subscription Details.\n\nClick Users.\n\n\nClick the Name of the User.\n\n\nClick Identifiers\n\n\nClick ERX ID and type in the eRx number (which eRx will provide to you)\n\nClick Save to apply the changes.\n\nYou are now ready to add your HPI-O and HI certificates to MediRecords.\n\nHPI-O and HI Certificates Overview\n\nNOTE: If you are already accessing My Health Record in MediRecords, then you can skip this step. The HPI-O and HI certificates would have already been configured at the time My Health Record was set up.\n\nFor a comprehensive guide, please consult the following article on connecting to the Health Identifiers service.\nWhat Is Required To Generate An eRx Token Successfully?\n "}