{"source": "https://support.medirecords.com/hc/en-us/articles/360000985375-Appointment-confirmations-using-two-way-SMS", "title": "Appointment confirmations using two way SMS", "body": "Appointment confirmations using two-way SMS\nTwo-way SMS allows patients to confirm or cancel specific appointments updating your appointment book in real time.  This article will cover how to add the appointment confirmation URL to your SMS template, sending appointment reminders linked to specific appointments and appointment status updates. \n  To add the appointment confirmation URL to your appointment reminders, you will need to add the appointment conformation merge field by creating or editing your default SMS template. \nTo do this navigate to SMS templates by selecting More followed by Settings then SMS Template. \nOnce within SMS Templates, please add the merge field\n{sms-template.AppConfirm}\nto your appointment reminder template named Default SMS Template by selecting the pen icon displayed below. \n\nOnce you have completed the SMS template, select save. Note: There must be a space after the link before additional text can be added. This is to ensure the URL generates correctly. \nIf you have created a new SMS template, you can select this as your appointment reminder default withing your configuration settings. To access your configuration settings, click on the Person Icon on the MediRecords menu ribbon, then click Preferences.\nSelect Appointments, then adjust your SMS reminder template by selecting a new default from the drop-down list, followed by Save. \nFor more information on how to configure and set appointment reminders, please see the link below. \nSMS Templates tutorial  \nThe appointment confirmation URL can also be added to SMS on demand if the patient has a future appointment. \nNote: More information on how to instantly send SMS can be found in the below article. \nHow to send SMS on demand\nThe patient will receive an SMS containing a appointment confirmation URL as displayed below. \n  Once opened the link will appear as below with the option to confirm or cancel the scheduled appointment. \nIf the appointment has yet to be confirmed by the patient, it will have the status of booked and will appear purple depending on the default screen filter. \n   Once the patient has confirmed the appointment, the appointment confirmation link will appear as per the below image with status confirmed. \nThis change will be reflected in the appointment screen of MediRecords in real time. Once the appointment is action by the patient the appointment status will change to either confirmed or cancelled (as displayed below). \nIf you are displaying your appointment screen by status, this will automatically change the colour to either blue for confirmed or grey for cancelled. \nNote: Once the patient has confirmed or cancelled the appointment, they cannot action the appointment reminder themselves and will have to contact the practice. \nIf the patient or the practice cancels the appointment, the URL generated for this appointment will display this information as shown below. \nIf the appointment has been marked as completed from within the appointment screen or the waiting room, the status will appear as completed and the appointment will appear green. \nFor an appointment with the status of completed, the confirmation URL will appear as per the below image indicating the appointment has been completed. \n    You should now be able to send appointment confirmations using two-way SMS. If this is not what you're looking for, head back to our knowledge base and search for another article.\nFor urgent assistance, please contact MediRecords support on 1300 103 903 during business hours."}