{"source": "https://support.medirecords.com/hc/en-us/articles/115001885092-Clinical-Clinical-Drawings", "title": "Clinical - Clinical Drawings", "body": "Clinical - Clinical Drawings\n\nIn this article Tutorial, you will learn how to manage a patient's clinical drawings, create new clinical drawings, upload images into the clinical drawer, and edit, delete, print and change the status of existing clinical drawings.\n\n\nThe Clinical Drawings page in a patient's clinical record displays a summary of all the clinical drawings, their category, type, source and status that have been created for that patient.\n\nTo Filter the List of Drawings, click Filter to reveal a drop-down list, and then select Active or Inactive.\n\n*Note: By default, the Clinical Drawings summary displays Active clinical drawings.\n\nTo Search for a Clinical Drawing, click the Search box type in a Keyword from the Comments or observations that were made at the time it was saved. Press Enter, and the system will display a list of the closest matches.\n\n\n\nTo Create a New Clinical Drawing, click New Clinical Drawing to open the clinical drawer.\n\n\nClinical drawings in MediRecords are stored under Category Type and each drawing relates to a Body Part.\n\nFor example, a Foot would be categorised as -\nCategory Type = External\nBody Part = Foot - External Foot\nTo begin a clinical drawing, select a Category, and click to the select the Body Part you want to view in the clinical drawer.\nClick Tools to select your drawing tool, click Colors to select a color, and then use the tool to apply the drawings to the image as required.\nClick Comments and type in any relevant clinical notes or comments.\nIf you want add the drawing to the consultation notes, click the Add to Today's Notes tick-box. If you want to make the drawing confidential, so that only you can see it, click the Confidential tick-box.\n*Note: A New Clinical Drawing can be added whilst on the Today's Notes screen by clicking on the Drawer button.\n\n\nIf you want to upload a photo into the clinical drawer, follow the steps below. Or, if you are satisfied with the image from the library, click Save to complete and return to the clinical drawings summary.\n\nWhen uploading an image to clinical drawer, make sure that the selected Category and Body Part match the body part of the image that is being uploaded. This will ensure that the image is correctly categorised within patient's record, and will make it easy to retrieve and review at a later date.\n\nOnce you have chosen a Category and Type, add any relevant Comments, and click Upload Image to open a file explorer.\n\n*Note: Images should be not more than 1 Megabyte in size, and the optimum dimensions are 550px (pixels) high by 450px wide.\nOnce the photo is uploaded, you can use the Tools and Colors to draw on the image.\nOnce the drawing is complete, click Save. \nRemember, if you want add the drawing to the consultation notes, click the Add to Today's Notes tick-box.\n If you want to make the drawing confidential, so that only you can see it, click the Confidential tick-box.\nThe newly created clinical drawing will now be visible in the Clinical Drawings summary.\nTo Open a Clinical Drawing, hover your mouse over the category of the drawing.\nWhen the cursor changes to a Finger Pointer, click the Name of the category.\nTo Edit a Clinical Drawing, click the Tick-box next to the name to reveal a list of options. Click Edit to open the clinical drawer.\nWhen editing a drawing, the Location and Body Part cannot be altered. Editing is limited to the drawing Tools and Colours, and Clinical Notes/Comments.\nReview or edit the clinical drawing as required, and click Save to apply the changes.\nTo Delete a Clinical Drawing, click the Tick-box next to the name to reveal a list of options.\nClick Delete to permanently delete the clinical drawing from the patient's record.\nClick Yes to acknowledge the drawing will be deleted.\nTo Delete Multiple Clinical Drawings at Once, click the Tick-boxes next to the names to reveal a list of options.\nClick Delete to permanently delete the clinical drawings from the patient's record.\nClick Yes to acknowledge the drawings will be deleted.\nTo Deactivate a Clinical Drawing, click the Tick-box next to the name to reveal a list of options. Click Status to reveal a drop-down list, and click Deactivate.\n\n\n*Note: Deactivating a clinical drawing does not delete it. The drawing will be removed from the summary, and placed in the Inactive list, which can be located by using the Filter.\n\nTo Activate a Clinical Drawing, switch to the list list of Inactive drawings by using the Filter.\n\nClick the Tick-box next to the name to reveal a list of options. Click Status to reveal a drop-down list, and click Activate.\nTo Change the Status of Multiple Clinical Drawings (Activate or Deactivate), click the Tick-boxes next to the names to reveal a list of options.\nClick Status to reveal a drop-down list, click either Activate or Deactivate.\nTo Print a Clinical Drawing, click the Tick-box next to the name to reveal a list of options. Click More, and then click Print to open a print preview.\nCheck to make sure the drawing is going to right printer Destination, select Layout and Colour if required, and then click Print.\n\n\n\n   "}