{"source": "https://support.medirecords.com/hc/en-us/articles/5088245296783-How-to-Add-Tasks-and-Clinical-Actions-to-a-Work-List", "title": "How to Add Tasks and Clinical Actions to a Work List", "body": "Tasks and Clinical Actions can be added to a Work List in one of two ways. This article will step you through both of these methods.\n  Method 1: Adding via the Work List\nCreate your Work List, or open an existing one by going to the clipboard icon, then selecting Work Lists. Tick the desired Work List, then click Edit.\n\nIn the Work List window, click the New button.\nSelect either New Task or New Clinical Action.\nThis will give you a pop-up of a New Task or New Clinical Action window. \nThe Assignee can be a User or User Group in your clinic. Select the desired option, then type in the name of the Assignee. \nComplete the rest of the fields as you would normally when creating New Tasks/ Clinical Action, then click Save.\nTo Edit an existing Task/Clinical Action, tick the check box to the left of the task item and click on the Edit Task button that appears above.\nTo Delete a Task/Clinical Action from a Work List, tick the check box to the left of the task item and click on the Delete button that appears above.\n    Method 2: Using the New Task and New Clinical Action buttons\nTasks and Clinical Actions can also be added to Work Lists using the existing New Task/New Clinical Action buttons that can be found in the upper right corner of MediRecords menu ribbon. \n\nThese buttons are also available in the patient's record, under Activities, and via the clipboard icon on the menu ribbon.\n  When adding a Task or Clinical Action using one of these methods, note that you will need to enter the Work List you wish to attach it to, by searching for and selecting it in the Work List field. To do this click on New Task/ New Clinical Action and you will get a pop-up. Select the Work List and all other required fields and Click Save. \n    Changing the Status\nOnce you have actioned your Task or Clinical Activity, you can change its Status. The Status can be changed from Open to Cancelled, Complete, or Escalated. To do this, tick the check box next to the task and click on Status above and select the desired action from the dropdown. \nNote that once it is changed to Cancelled, Complete, or Escalated, it can only be changed back to Open.\nYou have now successfully added a Task/Clinical Action to the Work List.\n  How to Create a Work List\n\n   "}