{"source": "https://support.medirecords.com/hc/en-us/articles/360000373175-Patient-Audit", "title": "Patient Audit", "body": "Patient Audit\n  This article will cover how to search for events using keywords and date ranges, and how to print the events displayed in the audit trail.\nThe patient auditing system relates to individual patients, and records events in the audit trail whenever a patient's record is altered. Any information that is added, changed, or deleted from patient's record is logged as an event in the audit trail. Any changes that occur in any section of the patient's record - Details, Clinical, Accounts or Activities - get automatically logged as an event in the audit trail.\nTo open a patient's audit trail, open the Patient Record and click the Audit tab.\n\n  The Patient Audit page displays a summary of changes, from all users, that have been made to the patient's record. From this page you can quickly see the Date, Time, and Description of the event, the Type of category of the event, and the User that performed the action.\n\n\n\nTo Filter the Audit Trail by Date Range, click Start Date and select the start date. Click End Date and select the end date. Press Enter and system will refine the audit trail to display only events that occurred between the two selected dates.\n    To Search the Audit Trail, click the Search-box and type in a Keyword from the Description. Press Enter and the system will display a list of the closest matches.\n    To navigate between pages, scroll to the bottom of the page, and use the directional arrows and page numbers to navigate the Audit Trail.\n  The directional arrows in order (from left to right) are: First Page, Previous Page, Next Page, and Last Page.\n    To Print the Audit Trail, click Print to open a print preview. \n  *Note: Clicking Print will print the audit trail that is displayed on screen only. This way, you can print the results of searches and filtered views of the audit trail. If you need to print multiple pages of an audit trail, you will have to print each page individually.\n  You've completed another MediRecords Tutorial. You should now be able to access and use the Patient Audit feature. If this is not what you're looking for, head back to our knowledge base and search for another article.\nFor urgent assistance, please contact MediRecords support on 1300 103 903 during business hours."}