{"source": "https://support.medirecords.com/hc/en-us/articles/360001890095-Password-Policy", "title": "Password Policy", "body": "Password Policy\nThe password policy allows the practice to control password specifications in the organisation for all users. \nThere are some key features which contribute to the password policy:\n1. Custom password requirements \n2. Automatic password expiration \n3. Prevent password reuse\n4. Password lock out after 5 attempts\nThe specifications are managed under System Configuration. To get here, click More > Settings > Configuration Settings System Configuration > Password Policy.\n  Custom Password Requirements\nThere are mandatory requirements when a user creates their password. These are:\n1) Minimum password length - can customise the minimum character length between 8 and 20. \n2) Requires at least one number\nThe remaining settings on this page can be customised to suit your organisation, such as needing to include one capital letter and/or one special character. \nSelect the check box next to the specifications you want to create as a requirement for password creation. \nAutomatic Password Expiration \nYou can set up an automatic password expiration by selecting the check box and specifying the amount of days the password should expire after.\nPrevent Password Reuse\nYou have the ability to prevent password reuse by selecting the check box and specifying the amount of days until a password can be used again. \nPassword Lock Out After 5 Attempts\nAfter 5 attempts with an incorrect password, the user will be locked out and will need to complete a password reset by clicking on Reset Password and following the prompts through their email.\n  You've completed another MediRecords Tutorial. You should now be able to customise your own password policy. If this is not what you're looking for, head back to our knowledge base and search for another article.\nFor urgent assistance, please contact MediRecords support on 1300 103 903 during business hours.\n             "}