{"source": "https://support.medirecords.com/hc/en-us/articles/360001269256-How-To-Schedule-and-Access-Telehealth-Appointments-Using-Coviu", "title": "How To Schedule and Access Telehealth Appointments Using Coviu", "body": "How To Schedule and Access Telehealth Appointments Using Coviu\nThis article will provide guidance on scheduling a Telehealth appointment, sending Coviu links to patients, and accessing the Coviu appointment link for both providers and patients.\nIt is important to ensure that the provider is properly configured before booking a Telehealth appointment, as failure to do so may result in being unable to book the appointment. If you receive a pop-up message, please refer to the instructions below to check your configuration.\nConnect to Coviu\nTo schedule a Telehealth appointment, navigate to your appointment book by selecting Appointments.  \nCreate an appointment for the provider that has linked to your Coviu account, by selecting within a Time Slot or clicking New Appointment. \nYou will be presented with the New Appointment Pop-up, please fill in required patient information. Please ensure the patient has either a Mobile number or email address entered. This is to ensure they receive the Coviu Consultation link. \nIf you would like to send this link via email, please enable email for the provider by following instructions in this link. If you would like to SMS the patient, you will need to include the Coviu Merge field in your default SMS Template using the instructions linked below.\nAdding Coviu links to your SMS Template\nSelect your Appointment Type (Telehealth), followed by Save. \nNOTE: Please ensure you have configured a Telehealth appointment type following the instructions in this link. \nThe Telehealth consultation has now been scheduled and can be viewed from your appointment book. \nNOTE: This consultation cannot be rescheduled in the past. \nBooking a Telehealth appointment creates a unique link for both the provider and the patient.  The following provides instruction on how the provider and patient can access a Coviu Telehealth consultation. \nProvider \nTo open the Coviu screen, navigate your appointment book and open the scheduled Telehealth Appointment. \nSelect the Telehealth Consultation hyperlink. \nNote: Only the provider will be able to select the link and open the Coviu consultation. \nThe Provider will then be redirected to the Coviu Consultation. Follow the instructions as directed to enable Audio and Visual access. \nAfter you have enabled Audio and Visual access, you will be presented with your Coviu consultation screen below. \nWhen the patient arrives to the consultation, you will need to permit them access by selecting Accept.  \nMore information on how to navigate your Coviu account can be found at the Coviu help page linked below. \nCoviu Help Page\nPatient \nOnce a Telehealth appointment has been scheduled, the patient will receive an Email or SMS with a link to the consultation. \nThe link will redirect the patient into the Coviu waiting room, where they will await admittance by the doctor. \nHow Do I Take a Singular Day Off in the Appointment Calendar\n   "}