{"source": "https://support.medirecords.com/hc/en-us/articles/360000240975-Sending-Letters-Through-Healthlink-Medical-Objects-Argus", "title": "Sending Letters Through Healthlink, Medical Objects & Argus", "body": "Sending Letters Through Healthlink, Medical Objects and Argus\n  This article will cover how to set up Medirecords for outbound correspondence through Healthlink,  Medical Objects or Argus and how to send to Health Professionals registered with these secure messaging vendors.\nFor more information about how to set up Healthlink, Medical Objects or Argus, please refer to our guide here.\nBefore being able to send outbound correspondence, your practice will need to register for outbound correspondence with either Healthlink, Medical Objects or Argus. Please contact them directly for more information.\nOnce setup has been confirmed, the Health Professionals you wish to send to need to be verified as users of these secure messaging vendors before you are able to send to them. If this is not done, the user will not appear as a possible addressee for correspondence.\n  To verify a Health Professional, access their contact record by clicking More on the Medirecords menu ribbon, then Resources.\nClick Contacts, then Health Professionals\nThis will bring up the Health Professionals Contact List.\nTo open a contact, click on their Name.\nTo check if the contact is registered with their currently listed Secure Messaging provider, hover your mouse over the (i) Icon next to Secure Messaging.\nTo assign a contact to a secure messaging vendor, select the vendor from the Secure Messaging drop down and click Validate.\nIf the validation has failed, an error will appear in the top corner of your browser; In this circumstance, confirm the health professional's details are correct (e.g., Provider Number, Name) and retry.\nIf the validation has succeeded, a confirmation box will appear in the top of the screen.\nNow that the contact has been verified, they are able to be sent correspondence via Secure Messaging.\nSending a Letter to a Health Professional Contact.\nAfter Creating a New Outbound Letter, search for the Contact by Name, then click Save.\nComplete the letter, then click File and Save.\nClick Save And Send.\nThe letter will now have been sent and is now visible in your Secure Messaging Outbox, by clicking the Secure Messaging Icon on the MediRecords menu ribbon, then clicking Outbox."}