{"source": "https://support.medirecords.com/hc/en-us/articles/115001659912-Messaging-Holding-Bay", "title": "Messaging - Holding Bay", "body": "Messaging - Holding Bay\n\nIn part two of the Messaging article, you will learn how to manage the secure messages located in the Holding Bay.\n\nThe Holding Bay \n\nTo open Messaging, click the the Mailbox Icon, which is the seventh tab on the MediRecords Application Ribbon.\n\n\n\nThe Message Counter next to the Mailbox Icon counts either the number of messages in your Inbox that have assigned to you, or the number of Unallocated messages in the Holding Bay. This behavior is dependent on your MediRecords subscription.\n\nHere is a breakdown of what items the Message Counter is counting, based on your subscription:\n\nClinical subscription: counts messages in your Inbox\nPractice Management subscription: no access\nIntegrated subscription: counts messages in your Inbox\n\nMessaging is divided into two sections - Holding and Inbox. Each of these sections will be covered individually in the following parts of this tutorial.\n\nPlease note that the Holding Bay is part of the Clinical module, and only accessible with a Clinical or Integrated subscription to MediRecords.\n\nHolding Bay Overview  \n\nThe Holding Bay is a collation area for all secure messages related to incoming investigations and inbound correspondence. Messages are kept in the holding bay until they have been read or actioned by the provider or addressee. When you open the Holding Bay, the list of messages has been filtered to display Unallocated messages.\n\nIf you have an Integrated subscription, there will be two buttons at the top of the page that allow you to switch between the Holding Bay and Inbox.\n\nIf you have a Practice Management subscription, you will not be able to see these two buttons.\n\nWhenever you open Messaging, it always loads the Holding Bay by default.\n\nTo Filter the Messages in the Holding Bay, click Filter to reveal a drop-down list and then select Allocated or Unallocated.\n\n\n\nTo search for a Message, click the Search box and type in a Keyword from the Subject. Press Enter the system will display a list of the closest matches.\n\nYou can also search using keywords from any of the column headings - including Patient Name on Report, Addressed To (provider), and the Patient or Provider that the message is assigned to.\n\n\n\nUnallocated Messages\n\nWhen messages arrive, the system can match them to both the provider, by linking the provider number, and to the patient, by matching patient demographics. If these fields cannot be matched, then the messages remain in the holding bay, flagged as \"Unallocated\".\nUnallocated messages cannot be formally actioned until they have been assigned to a patient and provider, however, the content can be previewed for the purposes of identifying the appropriate patient or recipient.\n\nTo Assign a Message to a Provider and Patient, click the Tick-box next to the name of the message.\nClick Add Patient and type in a keyword to look up the patient's name.\nClick Add Provider and type in a keyword to look up the provider's name.\nOnce you have selected the Patient and Provider, click Assign.\n\n\n*Note: You can just allocate a message to the Patient or the Provider, however, the message will not be moved to the provider Inbox until it has been allocated to both parties. When a message has been partially assigned to either a patient or a provider, it will be reflected in the Holding Bay.\n\nOnce you have clicked Assign, the messages will flagged as \"Allocated\", and be removed from the Unallocated list.\n\nYou can assign all relevant messages to the same patient and provider in bulk by selecting Multiple Tick-boxes adjacent to that particular patient and provider combination. Once you have selected the messages, add the Patient and Provider, and click Assign.\n\n\nIf messages arrive without a clear indication of which patient or provider they belong to, the content of the message can be previewed within the grid to assist with matching it to the right patient or provider.\n\nTo Preview a Message, click the Arrow on the right-hand side of the tick-box.\nThe message will expand in the grid, allowing you to preview the content.\nClick the Arrow again to close the preview.\n\n\n\nTo Place a Message on Hold, click the Tick-box next to the name of the message. Click More to reveal a drop-down list, and click Place on Hold.\n\n\n\nIf you receive regular messages that are not correctly being matched to a provider, you can assign an alias name to providers so that messages sent to that addressee will automatically link to the correct provider in the future.\n\n*Note: To create an alias for automatic matching, the provider number in the message must match the provider number of the doctor. If the provider numbers do not match, then the message will have to be manually allocated.   \n\nTo Set a Provider Alias, click the Tick-box next to the name of the message. Click More to reveal a drop-down list, and click Set As Provider Alias.\n\n\n\nTo Manage Existing Aliases, click More to reveal a drop-down list, and click Manage Aliases to open the alias manager.\n\n\n\nClick Select User and select the name of the user to manage or configure their aliases. There is no limit to the number of aliases that can be assigned to providers. \n\nAllocated Messages\n\nTo switch the list of Allocated messages, click Filter and click Allocated. Also click to remove to tick next to Unallocated.\n\n\nItems in the filter list with a tick next to their name are visible in the Holding bay.\n\n\nThe Allocated list in the holding bay displays a list of all the messages that have been allocated to both a Patient and a Provider (and are visible in their Inbox), but have not yet been actioned or reviewed. These messages will have an allocated name on both the Patient and Provider columns in the grid.\n\n\nThe Allocated list would typically only be used by users who do not have access to the Clinical module. The Allocated list is primarily used for housekeeping purposes, to make sure that messages in a provider's Inbox are being reviewed and actioned in a timely fashion.  \n\nYour Secure Messaging Inbox\nNeed help?\n1300 103 903\nsupport@medirecords.com"}