{"source": "https://support.medirecords.com/hc/en-us/articles/115001356411-My-Health-Record-Practice-Settings", "title": "My Health Record : Practice Settings", "body": "In this article My Health Record , you will learn how to setup and configure your practice and providers in MediRecords to connect to My Health Record, allowing you to access your patient's My Health Record documents.\n\nPrerequisites\n\nBefore you can connect to My Health Record, you need to register your practice with Medicare and obtain access to the Health Identifier (HI) Service, and obtain Health Professional Identifier - Organisation (HPI-O) PKI certificate.\n\nBoth access to the HI Service, and an HPI-O certificate are required to access My Health Record.  \n\n1. Access to the Health Identifier (HI) Service can linked to an existing PKI Certificate registered for your practice. Once access is obtained, the Health Identifier access number can be linked to your existing Medicare billing certificate, or to a NASH (National Authentication Service for Health) certificate.\n\nIf you are accessing My Health Record, but do not use Medicare billing certificates, then you will need a NASH certificate to access the Health Identifiers Service\n\n2. You will need to complete the Healthcare Organisation registration form on the My Health Record website. Applications can be completed either online or by mail. Once you have completed registration, you will be provided with an HPI-O Number and an electronic Certificate which needs to be uploaded to your practice profile in MediRecords.  \n\n3. Obtain a copy of all of your provider's HPI-I numbers. To use My Health Record, all doctors must have an HPI-I number recorded against their user profile in MediRecords. If the HPI-I number is not recorded, then that doctor will not have access to My Health Record.\n\n*Note: If you cannot locate your doctor's HPI-I number, they can contact either HPOS or APHRA to obtain a copy of their 16-digit HPI-I number.  \n\nOnce you have the HI and HPI-O certificates and pass-phrases, and your providers HPI-I numbers, you can configure your practice settings and users to connect to My Health Record.\n\nPractice Configuration - HI Certificates\n\nTo begin setting up My Health Record, you will need to upload your Health Identifier PKI Certificate to your practice profile in MediRecords, within the Health Identifiers section of Practice Configuration.\n\nTo open Practice Configuration, click More to reveal a drop-down list, and click Settings.\n\n\nClick Configuration Settings.\n\n\n\nClick the Practice Name.\n\n\n\nClick Health Identifier.\n\n\n\nClick Certificate Pass-Phrase (also known as PIC) and enter your HI Certificate pass-phrase, and then click Select File to open a file explorer window.\n\n\nNavigate to the location of your HI Certificate (called fac_sign.p12 or site.p12), and select it for upload.\n\n*Note: If you linked your Health Identifier to your existing Medicare billing certificate, you will need to select the fac_sign.p12 certificate that you received on the CD. Otherwise, your certificate will be called (Site.p12) \n\nClick Upload File, and then click Save.\n\nOnce the certificate has been saved, the Certificate Alias Name and the Expiry Date will automatically be populated on the form.\n\nStay within the Practice Configuration section of the app, as you will now need to upload your HPI-O Certificate.\n\nPractice Configuration - HPI-O Certificates\n\nYou will now need to upload your HPI-O Number and Certificate to your practice profile in MediRecords, within Practice Configuration in Settings.\n\nClick eHealth.\n\n\n\nClick Pass-Phrase (PIC) and enter the pass-phrase that you received with your HPI-O Certificate.\n\n\n\nTo upload your HPI-O Certificate, click Select File to open a file explorer window.\n\n\nNavigate to the location of the certificate (typically it will be stored on a CD, which was provided by Medicare).\n\nClick on the name of the certificate (called pac_sign.p12) and click Select or Open.\n\nClick Upload File to add the certificate to the practice's eHealth profile, and then click Save.\n\nOnce the file has been uploaded, the practice's HPI-O Number will automatically be populated to the HPI-O No. field, along with a Certificate Alias Name and Expiry Date., which are all digitally stored on the HPI-O certificate.\n\nThe practice configuration for My Health Record is now complete.\n\nProvider Configuration - HPI-I Numbers\n\nIn order for providers to use My Health Record, they must have their 16-digit HPI-I Number recorded into their profile. If a doctor does not have the HPI-I Number recorded against their profile, they will not be able to access My Health Record.\n\nThe HPI-I Number is added to the Identifiers section of the user profile, within User Settings.\n\nTo open User Settings, click More to reveal a drop-down list, and click Settings.\n\n\nClick Subscription.\n\n\n\nClick Users.\n\n\nClick the Name of the provider to open the user settings.\n\n\n\nClick Identifiers.\n\n\n\nClick HPI-I No. and type in the 16-digit HPI-I Number.\n\n\nClick Save to apply the changes.\n\nThe provider has now been configured to allow access to My Health Record. Repeat this process for any additional providers, and for any new providers that join the clinic in the future.\n  Need help?\n1300 103 903\nsupport@medirecords.com"}