{"source": "https://support.medirecords.com/hc/en-us/articles/115001690572-Welcome-to-MediRecords", "title": "Welcome to MediRecords", "body": "Welcome to MediRecords. \n\n\nNow that you have registered your practice for the first time on the MediRecords application, there are several steps that you need to complete to get the application up and running in your practice. To help you through this process, we have written this step-by-step setup guide.\n  Services Australia recently introduced Web Services to replace the existing \"Server Adaptor\" technology which had been in use for some time.\nThis is a newer technology that allows users to securely share data with various Services Australia entities.\nAuthentication will verify an individual's identity and organization against the Australian Business Register via a highly secure system called Provider Digital Access (PRODA). PRODA provides a higher level of security than PKI certificates and is fully digital and portable across web-enabled devices. \nThis means that organisations will no longer need to apply for and maintain a PKI certificate, and MediRecords will host and maintain a 'Vendor PRODA Device' on a server level.\n  New Providers will need to continue to ensure that an HW052 form is completed and processed before claiming to link the Provider number to the Minor Site ID. \nFor more information on how to Locate Minor Site ID click here.\n  The steps below will cover how to set up the Health Identifiers service for connecting to My Health Record and eRx for e-Prescribing.\nPrerequisites you will need:\nHPI-O number - NASH Certificate (fac_sign.p12)\n Provider HPI-I numbers \neRx ID’s for individual providers\n Register your organisation in the HI Service to obtain an HPI-O number and apply for a NASH Certificate. Click here to see how to apply.\nYou will need the NASH Certificate in the form of a P12 file, as well as the Personal Identification Code (PIC)\nObtain a copy of all your provider's HPI-I numbers.\nNote: If you cannot locate your doctor's HPI-I number, they can contact either HPOS or APHRA to obtain a copy of their 16-digit HPI-I number.\nBefore you can set up eRx in MediRecords, you will need to register for e-prescribing on the eRx website. To register, go here and click Register NOW in the right-hand corner of the page.\nOnce eRx has sent you the unique eRx ID’s per provider, you can begin configuring.\n  Here is a list of final steps you need complete within the MediRecords platform, It is important that you complete these steps in the order that they appear.\nIntroduction to Security Roles Security Role Security roles\nAssign Provider and Prescriber No.'s Provider & Prescriber No:\nInvestigations Templates  Letter Templates\nUser Configuration and Preferences  Configuration & Preferences\nAppointment Calendar Settings  Appointment Calendar Settings \nBanking and Accounts Bank Accounts\nMedicare Claiming Medicare Claiming\nBilling Settings Billing Settings\nFee Schedules Fee Schedules\nOnce you have completed these steps, you will be ready to migrate your data and patient records from your old system into MediRecords. MediRecords has trained technicians that will personally assist you with data migration. Please contact MediRecords Customer Service by phone or email to book a technician for data migration.\n\nMigration from Best Practice, Medical Director, Medtech 32, Zedmed can be completed for a flat rate. For all other vendors, please contact your account manager. \n\nMediRecords is integrated with a variety of secure messaging vendors and has been designed for you to easily update your practice settings to receive secure messages from other health professionals and laboratories.\n    Healthlink\nYou will need a Healthlink account to send and receive messages through Healthlink. If you don’t already have an account, you can create one on the Healthlink website. If you already have a Healthlink account, you will first need to contact them to advise you want your messages sent to MediRecords and provide them with your existing alias.\nMedical Objects\nSimilar to Healthlink, you will need to have a Medical Objects account to send or receive secure messages via Medical Objects. If you don’t already have an account, please visit the website to sign up here. If you already have an account, you will first need to contact them to advise if you want your messages sent to MediRecords and provide them with your existing details.\n   "}