{"source": "https://support.medirecords.com/hc/en-us/articles/7245309777295-MediRecords-2-0-What-s-New-User-Guide", "title": "MediRecords 2.0: What's New? User Guide", "body": "Introduction\nWelcome to the What’s New User Guide for MediRecords 2.0!\nThis guide will walk you through the new features and enhancements in the latest version of MediRecords, designed to improve your user experience and increase efficiency. Please refer to the sections below for detailed information on each feature.\nNavigation Menu\nThe Navigation Menu has been relocated to the left side of the screen, providing you with more screen space and a more efficient user experience. The submenu options can be accessed by clicking the vertical expand icon. The menu can stay minimized during screen transitions, and you can expand it by hovering your mouse over the menu or clicking the expand icon to secure it in place.\nSwitching Between Multiple Practices\nTo switch between multiple practices, click on the expander near the MediRecords Logo. You will see a list of all your available practices. Switching between them is now effortless, allowing you to seamlessly navigate between different practice settings.\nQuick Action Buttons\nThe Quick Action Buttons located at the top of the screen provide quick access to frequently used features, making your workflow more efficient. These buttons allow you to perform actions swiftly, saving you time and effort.\nHome Page\nThe Home Page has a redesigned layout aimed at improving usability. Adding your Appointment Calendar provides a quick glance at your schedule, helping you stay organised and on top of your appointments. Access to the MediRecords Knowledge Base is now more convenient, providing valuable resources just a click away. The Service Status feature provides real-time updates to keep you informed, and the MediRecords Blog keeps you engaged with the latest industry insights and updates.\nUniversal Communication Bar\nThe Universal Communication Bar features a chat widget and Notice board, which can be accessed from any screen, ensuring seamless communication and updates. The email icon is currently greyed out but will be available soon.\nAppointments\nThe Appointments feature has undergone several enhancements. The Available Times widget has been upgraded to help you find available appointment times more easily, considering the duration of the appointment and the provider's availability from specific user groups. The new List View screen allows you to filter appointments by practice, user, patient, and date, tailoring the view to your specific needs.\nPatients\nThe Patient Grid now has action buttons located on the right side of each screen for improved accessibility. This design change offers a more intuitive user experience, making navigation and interaction within the platform easier. The bright blue buttons draw attention to essential actions, ensuring they are easily accessible. Mandatory fields in the Patient Record are marked with an asterisk (*), enhancing visibility and making it easier to complete the required information.\nMedications\nThe Prescribing action buttons have been moved to the bottom of the form, providing a more user-friendly experience when prescribing medications. This change streamlines the workflow and improves usability.\nClaiming\nIn addition to visual upgrades, the action button for claiming has been replaced with a \"Details\" button, replacing the previous Hamburger Icon. This change improves usability and makes it easier for users to access detailed information related to their claims.\n                                                We hope this user guide helps you navigate and utilise the new features in MediRecords 2.0. Should you have any further questions or need assistance, please contact our support team.\n   "}