{"source": "https://support.medirecords.com/hc/en-us/articles/115001419552-Users-User-Profile", "title": "Users - User Profile", "body": "Users - User Profile\n\nThere are five separate sections within a Users profile that can be configured. In part four of the Users Tutorial, you will learn about the configuration options available within each of these sections.\n\n\n\nDetails\n\nWhen a Users Profile is opened for editing, it lands on the Details section by default. The Details section contains important information about the Users Profile, most of which can be edited or updated within this section.\n\nTo update or edit Details, click on the Field that you want to edit, and then click Save to apply the changes.\n\n \n\nSubscription\n\nThe Subscription section is for editing or updating the Users Subscription in  MediRecords.\n\nIf you make any changes to a Subscription, remember to tick the \"I Agree\" tick-box to acknowledge and approve the additional charges to your monthly subscription. \n\nClick Save to apply the changes.\n\n\n\nSecurity\n\nThe Security section is for editing or updating the Users Security profile.\n\nThis section is used for Assigning Security Roles, resetting a Users Password and updating Secret Questions and Answers in the Users profile.\n\nTo make changes to a Users Security Role, click the Drop-down List and select a the new Security Role.\n\nFor more information about Security Roles, please visit the Security Settings Support Page.\n\nTo reset a password, click Reset Password and a notification will pop-up advising that an email has been sent to the user with a link to reset their password. Click OK to acknowledge that the email has been sent.\n\nIf you make any changes to Security Role or Secret Questions and Answers, remember to click Save to apply the changes.\n\n\n\nIdentifiers\n\nThis section is used for editing or updating a Users unique Healthcare Identification Numbers - like a Provider No. and Prescriber No.\n\nIf the doctor practices at multiple clinics that are all part of the same MediRecords Subscription, then the User will need a separate Provider No. for each clinic.\n\nIf you make changes to, or update any Identifiers, remember to click Save to apply the changes.\n\n\n\nBiography\n\nThis section is used for editing or updating the users Biography. A Biography is historical information about the User that is relevant to both their position at the clinic, to their patients and to the MediRecords Community.\n\nThe Biography is used for storing details of Medical Qualifications, Specialties, Languages Spoken and the Age/Gender of the User. In this section you can also share the Users Profile with MediRecords Community.\n\nMedical Qualifications must be updated if the User is a provider that prescribes. To update, click the Medical Qualifications field and enter in the details. \n\nTo share the Users profile with the MediRecords Community, click the Add my user profile... check-box.\n\nIf you update, or make any changes to a users Biography, remember to click Save to apply the changes.\n\n \n\nIf you need further assistance please contact support on 1300 103 903 or email at support@medirecords.com\nAdd Users to MediRecords"}