{"source": "https://support.medirecords.com/hc/en-us/articles/360000230576-Managing-Your-Existing-Recipes", "title": "Managing Your Existing Recipes", "body": "Managing Your Existing Recipes\nMediRecords allows you to manage your Drug Recipes with a variety of functions, as highlighted below.\nThis tutorial will go through each one, using examples to demonstrate.\n\nSearch \nTo search for recipes, click the search bar and type in a keyword. Click the search icon. Alternatively, you can hit Enter or Return on your keyboard.\n\n\nThe results will match your search term by Name.\n\nEdit\nYou can only edit recipes you have created. Check the box of a recipe and click Edit.\n\nYou will be brought to the Edit Recipe form. Make the changes as necessary and click Save.\n  Filter\nYou can filter the drug recipes based on Scope (privacy of recipe) and Status (Active or Inactive).\nFor this example, we will filter for Active Practice recipes only. \n\nThe screen will update to match your filter search. \n  Delete\nSimilar to Edit, you can only delete recipes you have created. Check the box next to one of your recipes and click Delete.\n*NOTE: Deleting a recipe is a permanent action and cannot be reversed.\n\nYou will be greeted with a warning prompt. Click Yes to proceed.\nThe drug recipe has now been deleted.\n  Deactivate/Activate\nYou can manage the active status of drug recipes. To deactivate a recipe, check the box next to it. Click on Update Status and select Deactivate.\nThe recipe has now been deactivated. To reactivate a recipe, change the Filter to show only Inactive recipes, as shown.\nCheck the box next to the inactive recipe, click Update Status, and select Activate\nThe recipe is now active again.\n\n\nClone\nTo clone a recipe, check the box next to one. Click More and select Clone.\n\nIf this is not what you're looking for, head back to our knowledge base and search for another article. For urgent assistance, please contact MediRecords support on 1300 103 903 during business hours."}