{"source": "https://support.medirecords.com/hc/en-us/articles/360000233376-EPC-Explained", "title": "EPC Explained", "body": "EPC Explained\n  The Extended Care page in a patient's clinical record displays a summary of the EPC (Enhanced Primary Care) activities recorded for that patient. Within the summary you can see the assessment date, category, name, provider, and the duration of the assessment. This tutorial will provide a brief overview of this section and its functions.\n\nTo access the extended care page, Open the Patient Record and click on the Clinical tab.\n\n\n\nClick on the Extended Care section.\n\n\n\nYou will now be brought to the Extended Care screen.\n\n\n\nChecking the box next to an entry will reveal options as shown. There is also a Search field and the Filter on the right.\n\n\nSearch\n\nYou are able to search for templates by Name, Category, Provider, and Comment, using free text.\n\nIn this example, we will search \"Diabetes\". Enter the term and click the search icon. Alternatively, you can press Enter or Return on your keyboard.\n\n\n\nThis will display all results which match the search term.\n\n\n\nFilter\n\nClick on Filter. You will see these following options as the filter criteria.\n\n\n\nStatus\nThis allows the filter to screen the EPC activities on their active status. \n\nExtended Care\nThis allows the filter to screen based on the EPC template.\n\nIn this example, we will search for templates of Active status and Health Reviews. Select the options as shown.\n\n\n\nYou will be shown results that match the filter criteria.\n\n  Edit\nSelect the checkbox of the EPC activity you wish to edit and click Edit.\n\n\n\nYou will be shown the activity form. Make the changes as necessary and click Save.\n\n\nDelete\n\nNote: This is a permanent action and cannot be reversed.\n\nTo delete an activity, check the box next to the name and click Delete.\n\n\n\nYou will be shown a warning message. Click Yes if you wish to proceed or No to cancel.\n\n\n\n\nActivate/Deactivate\n\nYou can manage the active status of your EPC activities from your view.\n\nSelect the checkbox to the left of each activity. Click Status and select Deactivate.\n\n\n\nYou can also make the activity active again. First, click on Filter and select Inactive. Ensure that Active is not selected.\n\n\n\nCheck the box on the left of the activity, click Status and then Activate.\n\nYour activity will now be Active again.\n\nPrint\n\nCheck the box next to the name of the activity you would like to print. Click More and select Print.\n\n\nYou will be taken to your in-browser printing page. Ensure all settings are correct and press Print. \n\nYou should now have a brief understanding of how EPC is managed within MediRecords, and the functions you can use. If this is not what you're looking for, head back to our knowledge base and search for another article.\n\nFor urgent assistance, please contact MediRecords support on 1300 103 903 during business hours."}