{"source": "https://support.medirecords.com/hc/en-us/articles/115001660732-Bulk-Scan-Upload", "title": "Bulk Scan Upload", "body": "Bulk Scan Upload\nBulk Scan Upload allows you to easily upload your scans, faxes and other documents into MediRecords. Once documents have been uploaded, they can easily be allocated to both patients and providers, as either Correspondence or sent to the provider's mailbox for further review. \n\nBulk Scan Upload is located within Utilities in MediRecords. To open Utilities, click More to reveal a drop-down list and then click Utilities.\nClick Bulk Scan Upload.\n\nTo begin to upload documents, click Upload to open a file explorer window.\n*NOTE: The supported file types are JPG, PNG and PDF, and the maximum file size is 10mb (per file).\nSelect the document(s) you wish to upload, and click Open or Select to begin the upload.\n\n\n\nWhen the documents begin to upload, they are visible with a Light Blue progress bar indicating the progress of the upload. \n\nOnce the documents have been uploaded, they are displayed in a darker shade of blue, with Checkbox next to the file name.\n  To view of preview of a document, click the File Name to open a preview on the right-hand side.\nTo allocating the documents to patients and providers, click the Tick-box next to the name of the uploaded document.\n\nSelect who the document is From, where is it to be Filed, the name of the Patient, who it is To, the Category and a Subject for the patient record.\n  *NOTE: If File In is Correspondence, the From & To fields are not mandatory.\n  You are able to create a new Health Professional Contact to use in the From field by clicking on the + Icon next to From.\nFill in all necessary information, and click Save. Please note that only legitimate Provider Numbers are able to be used when creating a contact.\n*NOTE: This contact will be automatically shared to Practice. For more information about Health Contacts, please click here.\nYou are able to select multiple uploads at once to allocate them to same provider and patient.\n  Once you have select the documents and completed the required fields to allocate them, click Assign to move the documents to the selected location.\n\n\nOnce the documents have been assigned, they will be removed from the Bulk Scan screen and filed in their select locations. Correspondence will be filed in the patient's clinical record, documents for the Inbox will be visible in the providers Mailbox, and Referrals will be filed in referrals in the main patient record.\n  How do I Create a New Patient Education Resource? click here.\n  If you need further assistance please contact support on 1300 103 903 or email at support@medirecords.com"}