{"source": "https://support.medirecords.com/hc/en-us/articles/8812125244303-Adding-Wards-Rooms-and-Beds", "title": "Adding Wards, Rooms and Beds", "body": "This article will demonstrate how to add Wards, Rooms and Bed in Admission Module.\nNavigate to the More and Click Settings\nSelect License &Features\nClick Admissions\nClicking the bed icon in the facility configuration page will redirect the user to the list of wards, rooms and beds configured under it\n  Adding Wards\nTo create a ward, the user needs to click the “Create New” button and select Ward.\nPopulate the mandatory fields:\nClicking “Save & Add New” will automatically append the created ward to the grid without dismissing the form so that users can add another ward in the practice.\n  Adding Room\nThe users can create individual rooms without an associated ward. This is being done by clicking “Create New” button and select Room.\n  Populate the mandatory fields:\n \n\n\n Clicking “Save” will automatically append the created room to the grid.\nClicking “Save & Add New” will automatically append the created room to the grid without dismissing the form so that users can add another ward in the practice.\nUsers can also associate the room in a specific ward by clicking the add button in the row of the ward that the room will be added to. Clicking this will have the option to create a room or bed. Clicking the room will launch the same Create Room modal.\n  Adding Bed\nTo create a bed, users can click the add button in Room and Bed Configuration\nTo Add Bed in Wards, User Can click add button then Click the Bed icon to add Bed\nTo Add Bed in Room, User Can Bed icon to add the Bed\nPopulate the mandatory fields:\nClicking “Save” will automatically append the created bed to the grid.\nClicking “Save & Add New” will automatically append the created bed to the grid without dismissing the form so that users can add another ward in the practice.\n "}