{"source": "https://support.medirecords.com/hc/en-us/articles/115001338172-Community-Sessions-Appointment-Types", "title": "Community Sessions & Appointment Types", "body": "Community Sessions & Appointment Types\nTo enable your patients to book appointments online using the MediRecords patient mobile app or the MediRecords Appointment Widget, you will need to set up \"Community\" sessions for each user and share the appointment types that can be booked. This will ensure that the MediRecords Community calendar and MediRecords Appointment Widget Calendar reflect the available times.\n  Community Sessions\nEstablishing a community session for your practice or providers follows a similar process as creating regular sessions.\nTo create a community session, first navigate to the Sessions section of Appointment Settings and click New Session.\nWhen the new session form opens, click Calendar to reveal a drop-down list, and click Community.\nComplete the rest of the form with all the required details, and click Save.\nOnce created, the community session will be displayed on your appointment calendar and in the MediRecords Community, allowing patients who use the mobile app to schedule appointments online. It's important to note that a separate community session must be created for each practice and doctor for each day of the week they want to be visible in the MediRecords Community calendar.\n\nTo quickly view your list of community sessions, click Filter to reveal a drop-down list, and then click Community. \nSharing Appointment Types\nTo have appointments available to be booked through the app and the Medirecords Appointments, what appointment types can be booked need to be designated. This is done by adding them to the community. \nFor more information about Appointment Types, please refer to our article here.\nTo add appointment types to the community, click Appointment Types, then click Edit after hovering over the appointment type you wish to add.\nClick the Tick-Box next to Community, then click Save.\nThis appointment type is now available to be booked in community sessions.\nHow Do I Take a Singular Day Off in the Appointment Calendar?"}