{"source": "https://support.medirecords.com/hc/en-us/articles/115001610691-Resources-Patient-Education", "title": "Resources - Patient Education", "body": "MediRecords has a growing database of patient education material sourced from Sanoa Health and the NPS. Fact sheets on common questions like Malaria information, Smoking Cessation and Pelvic Floor Muscles are already available for you in the MediRecords Community. If you have your own materials, you can add them to your practise' Library, or even share them to the community for others to benefit from. Have a look at what's already available for your use and rate the content you see to highlight the good and the great.\n\n\n\nResources - Patient Education\n\nIn this article, you will learn how to find patient education material to share with patients, rate existing patient education material, and create new patient education articles that can be used privately, or shared with your practice and the MediRecords Community.\n\nTo access your list of patient education resources, open the Resources page (click More -> Resources) and click Patient Education.\n\n\n\nThe Patient Education page displays a summary of the patient education material that is available for you to share with your patient. From this page, you can see who published the article, the category, name, file type, where it is being shared, the community rating and the status.\n\n\n\nTo Filter the list of Patient Education resources, click Filter to reveal a drop-down list, and select a filter under the headings Scope, Status or Publisher. Or you can select a combination of all three. The type of resources being displayed will have tick next to their name.\n\n\n\nTo Search for a Patient Education resource, click the Search box, and type in a Keyword from the Name. Press Enterand system will display a list of the closest matches.\n\n\nTo Open an Existing Patient Education Resource, click on the Name to open it in another tab or window (depending on your web browser settings).\n\n\n\nIf the page does not open, you may need to \"Allow pop-ups\" from MediRecords in your web browser settings.\n\nTo Print or Save a Copy the Resource from your web browser, navigate to your web browsers Menu, (usually in the left or right-hand corner) and click Print or Download.\n\n\n\nTo Create a New Patient Education resource, click New Patient Education to open the PE import form.\n\n\n\nClick to select the Category, Type and Sharing, and type in the Name of the resource.\n\nClick Select File to open a file explorer, and select the file to upload.\n\n\n\nOnce the file has has been uploaded, the File Name will appear on the PE import form.\n\n*Note: File size must not exceed 1mb, and must be a JPG, PNG or PDF file type.\n\n\n\nOnce the file has been uploaded, scroll to the bottom of the form and review the terms and conditions of sharing patient education resources with the MediRecords Community.\n\nClick Save to acknowledge and consent to the terms and conditions.\n\n\n\nThe newly created patient education resource will now be available to you, your clinic or the whole MediRecords Community (depending on how it was shared).\n\nTo Edit a Patient Education resource, click the Tick-box next to the name to reveal a list of options. Click Edit Patient Education to open the PE import form.\n\n\n\nUpdate the form with all required changes. To upload a new file, click Select File to open a file explorer, and select the file to upload.\n\nScroll to the bottom and click Save to apply the changes.\n\nTo Preview a Patient Education resource, click the Tick-box next to the name to reveal a list of options. Click Preview to open the resource in another tab or window (depending on your web browser settings).\n \n\n\nYou can remove patient education resources from your list by changing the status. Deactivating a resource will remove it from your list, but will still be available to all other parties that it is shared with. Deactivated resources will still be available by using the Filter in the Patient Education summary, and selecting Inactive under the Status heading.\n\nDeactivated resources can be Activated again, and will then be available in your resources list once more.\n\nTo Deactivate a Patient Education Resource, click the Tick-box next to the name to reveal a list of options. Click Update Status to reveal a drop-down list, and click Deactivate to move it to your list of Inactive patient education resources.\n\n\n\nTo Reactivate a Patient Education Resource, navigate to the list of Inactive patient education resources (click Filter > (Status) Inactive to switch to the Inactive list).\nClick the Tick-box next to the name to reveal a list of options. Click Update Status to reveal a drop-down list, and clickReactivate to move it to back to your list of Active patient education resources.\n\n\n\nTo Update the Status of Multiple Patient Education resources, click the Tick-boxes next to the names to reveal a list of options. Click Update Status to reveal a drop-down list, and click Deactivate or Activate.\n\nThis process is the same for both Active or Inactive patient education resources.\n\n\nTo Print a Patient Education resource, click the Tick-box next to the name to reveal a list of options. Click More to reveal a drop-down list, and then click Print to open a print preview.\n\n\nCheck to make the sure the page is going to the right printer Destination, select Layout and Color if required, and then click Print.\n\nTo Delete a Patient Education resource (that you have created), click the Tick-box next to the name to reveal a list of options. Click More to reveal a drop-down list, and then click Delete to permanently delete the resource.\n\n\n\nClick Yes to acknowledge the resource will be deleted.\nNeed help?\n1300 103 903\nsupport@medirecords.com"}