{"source": "https://support.medirecords.com/hc/en-us/articles/6082369870223-Why-is-my-patient-s-IHI-number-disappearing", "title": "Why is my patient's IHI number disappearing?", "body": "If you are attempting to validate a patient's IHI number or save the IHI number to their record, and it disappears, this is due to the IHI validation not being successful according the Health Identifier Service.\n  MediRecords will send a payload to the HI Services that contains patient information.\nIt looks like this:\n\n\"lastName\":\"Smith\", Patient's last name\n\"gender\":\"M\", Patient's Gender\n\"ihiNumber\":\"8003607330180789\", IHI Number\n\"dob\":\"15032000\", Date of Birth\n\"certificateAliasName\":\"subject cn=general.8003624485707130.id.electronichealth.net.au, sn(hex)=152c0, usage=encrypt, expiry=20240615\", NASH Certificate info\n \nIf the HI Service can match the supplied IHI number to the Patient name, gender and DOB, we will receive this response from the HI Service and the number will remain in the field:\n\n\"ihiNumber\":\"http://ns.electronichealth.net.au/id/hi/ihi/1.0/8003607330180789\",\n\"numberStatus\":\"Active\",\n\"recordStatus\":\"Verified\",\n\"exception\":null,\n\"timeStamp\":\"2022-12-17T13:30:56.564+11:00\"\n  The Statuses will change to Active and Verified.\n \nIf the HI Service cannot match the supplied IHI number to the Patient name, gender and DOB, we will receive this response and the number will be automatically removed:\n\n\"exception\":{\n\"code\":\"01439\",\n\"description\":\"(INFORMATION) No Healthcare Individual records have been found.\"\n},\n\"timeStamp\":\"2022-12-16T21:42:06.496+11:00\",\n\nAnd if you hover over the 'i' after the number disappears, you will see the response from HI.\n  Due to the fact that the HI Service is telling the system that this number does not belong to this person, the IHI number is automatically removed to prevent any mistaken or illegal prescribing to an incorrect patient, as well as keeping the IHI number owner's My Health Record safe from being accessed by an unconsented provider.\n\n  If you are having further issues with a patients IHI number, you can advise the patient to contact Health Identifier Services to verify their information on 1300 361 457. "}