{"source": "https://support.medirecords.com/hc/en-us/articles/115001652471-Instant-Chat-Chat-Basics", "title": "Instant Chat - Chat Basics", "body": "Welcome to the MediRecords Instant Chat.\n\nThis article has been written to give new users a detailed overview of how to use Instant Chat, Patient Related Chat, and configure Chat Groups in MediRecords. Each of these topics will be covered individually in the following parts of the Instant Chat article.\n\nInstant - Chat Basics \n\nIn this article Instant Chat, you will learn the basic fundamentals of sending and receiving chat messages in MediRecords.\n\nInstant chat in MediRecords is located in two separate areas - on the Home page, and within a patient record, for a chat that relates specifically to that patient. In this, you will learn the basic fundamentals of instant chat - how to create new chat sessions with users at your practice, how to invite community members into chat, how to identify unread messages, and how to understand message notification pop-ups that appear at the bottom of your browser.\n\nInstant Chat Overview (Home page)\n\nInstant chat is most commonly used from within the Home page in MediRecords. The Chat module is next to the Noticeboard and contains a full list of all of your chat threads. The counter represents the number of unread chats you have in your message box.\n\n\nWhenever you start a new chat session with a user, a new chat thread is created. MediRecords stores a full history of your chat threads on the Home page. You can navigate your historical chat threads by using the scrollbar or your mouse wheel.\n\nTo search for a message, click the Search-box and type in a Keyword from the message you are looking for. You can also use keywords from the patient name to search for messages where a patient file was flagged in the message.\n\nPress Enter and the system will display a list of the closest matches.\n\n\n\nTo filter the list of messages, click Filter to reveal a drop-down list and select one or more filters under Status and Period.\n\n\n\nChat Message Notifications\n\nWhen you receive a new chat message from another user, you will receive a pop-up notification in the bottom right-hand corner of the screen.\n\n\n\nYou can click on the message to view it right away, or you can return to the Home page where it will be saved in your chat threads as an Unread message.\n\nTo help you keep track of the number of unread messages you have, MediRecords uses an Unread Message Counter on the Chat icon on the Home page.\n\n\n\nThe message counter is live, and will automatically increase as you receive new chat messages. You do not need to refresh the page to check if another user has sent you a chat message.  \n\nCreating New Messages\n\nTo create a new chat message, click New.\n\n\n\nIn the new chat form, you can choose to send a message to Users, a member of the MediRecords Community, or a predefined Chat Group at your practice. For more information on Chat Groups, please review Instant Chat: Chat Groups.\n\n*Note: To send a message to a Community member, your user profile must be published and shared with the MediRecords community. Click here for instructions on how to publish a user's profile on the MediRecords community, or for more information on how to join, check out our Video introduction.\n\nInterested in knowing more about the community? Check out our video overview on Vimeo, called Welcome to the MediRecords Community.\n\nIn the example below, a message is being sent to another MediRecords user.\n\nClick Search User and type in the first three letters of the user's name to display a list of the closest matches. Click to select the name of the user that you want to chat with.\n\n\n\nMultiple users can be included in a chat message, allowing you to chat together as a group. Additional users can be added to the chat message using the same search and selection process.\n\n\n\nAt this point you could flag a patient name in the message, to let the recipient know which patient the message relates to. For more on patient-related messages, please review Instant Chat Patient-Related Chat.\n\n\n\nChat messages are flagged as Low Priority by default. To change the priority, click the Down Arrow and select either Low, Medium or High priority.\n\n\n\nClick the Text-box and type in your message.\n\n*Note: Chat messages are restricted to a maximum of 500 characters.\n\n\n\nClick Send to initiate a chat session with the selected user/s. \n\n\n\nResponding to Chat Messages\n\nWhen you receive a new chat message, or a response via an existing chat thread, it will be flagged with a Blue Dot next to it, indicating that it is Unread.\n\n\n\nTo respond to a chat message, hover your mouse over the message and click to open the message.\n\n\n\nIndividual chat threads have a message box at the top, and a full history of the chat thread is stored below the message.\n\n\n\nTo write a response, click the Text-box and type in a message.\n\n\n\nPress Enter, or click Send to send the message.\n\n\nThe sent message will then appear in the chat thread below.\n\n\n\nTo delete a message that you have sent, click the Bin Icon to permanently delete the message from the thread.\n\n*Note: You can only delete messages you have sent, not messages sent by other users.\n\n\n\nThe message will immediately be deleted from the thread, and will no longer be visible to any user, either in the chat thread, or on the Chat section of the Home page.\n\n\n\nTo exit a chat thread, click X icon to return to the list of messages."}