{"source": "https://support.medirecords.com/hc/en-us/articles/115001925892-Clinical-Demographics", "title": "Clinical - Demographics", "body": "Clinical -  Demographics\n\nIn this article, you will learn how to manage a patient's clinical demographics, which are located on the Details tab of the patient record.\n\nPatient demographics include Social, Tobacco and Alcohol habits, and their Family History of medical conditions that may, or may not, affect the patient's medical well-being in the future.\n\n\n\nDemographics\nThe Demographics section of a patient's clinical record contains the patients identifying information.\n\nIt also contains information relating to the patient's Primary and Secondary Addresses, Emergency Contacts, Referrals, and Family.\n\n\n\nSocial\n\nThe Social section of a patient's clinical record is for keeping record of the patient's social habits and lifestyle choices. Social details often change over time, so all information within this section is very easy to update as patients grow older and their habits and lifestyle choices change.\n\nTo add or update any social information about a patient, click the Field Name and enter in the details. Click Save to apply the changes.\n\n\n\nTobacco\n\nThe Tobacco section of a patient's clinical record is for performing an assessment of the patient's smoking habits. Assessments may include both past and present smoking history.\n\nTo start a smoking assessment, select whether the patient is a Non Smoker, Ex-Smoker or Smoker. \n\nThe Assessment Date defaults to today, however it can be back-dated if the assessment was performed elsewhere or on another day.\n\nComplete the rest of assessment form with all the required details, and click Save to apply the changes.\n\n\n\nAlcohol\n\nThe Alcohol section of a patient's clinical record is for performing an assessment of the patient's drinking habits. Assessments may include both past and present drinking history.\n\nTo start an alcohol assessment, select whether the patient is a Non Drinker, Ex-Drinker or Drinker. \n\nThe Assessment Date defaults to today, however it can be back-dated if the assessment was performed elsewhere or on another day.\n\nComplete the rest of assessment form with all the required details, and click Save to apply the changes. \n\n\n\nFamily History\n\nThe Family History section of a patient's clinical record is for recording any relevant family history that may, or may not, result in future medical issues.\n\nTo add family medical history, un-tick the No Significant Family History tick-box.\n\nIn the first section, you can record details about the patient's Mother and/or Father. You can also add details of medical issues about other direct family, relatives and spouses in Family History Details.\n\nOnce you have completed the form with all the required details, click Save to apply the changes.\n\n\n\nNeed help?\n1300 103 903\nsupport@medirecords.com"}