{"source": "https://support.medirecords.com/hc/en-us/articles/360000223575-Sales-Dashboard", "title": "Sales Dashboard", "body": "Sales Dashboard - Overview\nOutstanding sales\nNew Invoice\nMultiple Patient Invoice\nPayments \nQuotes\nThe Sales dashboard displays a summary of all open and outstanding invoices in your account.\nClick Account and select Sales.\n  You will be brought to the Sales dashboard. There are four 'Doughnut' style graphs on the dashboard that reflect your Total Outstanding, 0-30 Days Past Due, 30-60 Days Past Due, and 60+ Days Past Due invoices. Similar to the Claiming dashboard, the graphs are color-coded to represent the type of Payer on the invoices (e.g. Blue represents Medicare).\n \nYou can filter the list of invoices by payer, by clicking on the corresponding colour on the doughnut graph. For example, if you want to view open invoices where the payer is a patient, click the Amber section of the doughnut.\n \nTo restore the list of invoices to display all open invoices, click the $ value in the middle of the doughnut.\nTo search for an outstanding invoice, click the Search box and type in a Keyword from the Name (first, last, or full), Invoice No., Payer, or Provider. Press Enter and the system will display a list of the closest matches.\n \nYou will notice that there are three functions: New Invoice, Receive Payment, and Provide Quote. These are accessible regardless of the graph you have clicked.\n  New Invoice \nTo create a new invoice, click New Invoice. You will have two options: New Invoice and New Multiple Patient Invoice.\n\nIf you select New Invoice, follow the same steps as detailed in the Patient Billing article/s.\nIf you select New Multiple Patient Invoice, you will be given the following screen. Click on the Patient field.\n\nTo fill out a multiple-patient invoice successfully, you must ensure you put in at least two patients in the selected patient's popup. Click Save when finished.\n\n                                            Payments\nTo receive a payment, click Receive Payment.\n  Select New Multiple Payment or New Payment to open a blank payment form.  \nComplete the form with all the required details, and then click Payment.\nNOTE: For additional instructions on how to use the Multiple Payment Module, please see this article \n  Quotes \nTo provide a quote, click New Quote to open a blank quote form. \n  This is virtually identical to the New Invoice form, but the difference is that only the Print function is present.\n\nSales Activity Ledger\nThe Sales dashboard also contains a Sales Activity ledger, which displays a list of all invoices, both paid and unpaid, that have been created in your system.\nTo open the Sales Activity ledger, click the Hamburger icon (three short horizontal lines) at the top right-hand side of the Sales dashboard. The ledger will open as a sidebar on the right-hand side of the page.\n  Sales Activity is sorted by newest to oldest by default. At any time, you can close the sidebar by clicking the X at the top of the ledger.\nTo search the ledger for an invoice or quote, click the Search Box, and type in a Keyword from the Name (first, last, or full), Invoice No., Payer, or Provider. Press Enter to confirm the search.\n                                                                            To filter the sales activity list, click Filter to reveal a drop-down list of filter options.\nClick to select one or more filters under Invoice Status, Quote Status, or Provider, or one of the predefined historical date ranges at the bottom of the filter.  When a filter is selected, it will have a Tick next to the name. Click the selection again to un-tick and remove the filter.  You can also search for a provider by typing in the keyword or first and last name in the search bar.\n                                                      Export Information\nTo export information from the sales screen, click on the Export button located under the Receive Payment button.  This information will be presented in an Excel spreadsheet.  Look out for it at the bottom of your page as a downloaded document. \n                  If you would like to more about how to create invoices within a Patient Record please click here\n\nHow Do I Create a New Invoice?"}