{"source": "https://support.medirecords.com/hc/en-us/articles/360000196796-Creating-a-New-Patient-View", "title": "Creating a New Patient View", "body": "Creating a New Patient View\nUsers within the practice have the flexibility to generate numerous custom views, which can prove valuable for filtering patients according to particular criteria, such as age range or date of their last appointment. This tutorial will illustrate how to utilize this feature.\nTo begin, click New View to open the create view form. Alternatively, you can also click the Create New View button.\nAs a practical example, this is how to create a custom view of \"Male Patients, 40 Years or Older\".\nClick View Name and enter a meaningful name for the view. Click Sharing and select whether or not you want the view to be Private, available to the whole Practice, or to every MediRecords user with Global Contacts. In this case, we will pick Practice. In the first field, you need to select the location of the data you are searching for. In this case we are looking for information from the patient demographics section. \nClick the first field and scroll down to the Patients heading and select Patient. Click the second field and select Gender. Click the third field and select Equals. Click the last field and select Male. \nTo screen for age, we will need to add another search clause - to do so, click And.\nIn the second search clause, follow the same steps as before, however this time, search for the patient's Date of Birth. Click the first field, scroll down to the Patients heading and select Patient. Click the second field and select DOB (Date of Birth). Click the third field and select On or Before. Click the last field and type or select the Date (40 or more years ago).\nThis query will now search and display all patient records where gender is indicated as male and the date of birth places them at age 40 and above.\n6. Click Save to save the custom View. 7. Once the form has closed, your newly created view will be visible in the list of Saved Views.\n  How to Remove a Patient View?"}