{"source": "https://support.medirecords.com/hc/en-us/articles/5427719321359-SMS-Mail-Merge-Fields-Function", "title": "SMS Mail Merge Fields Function", "body": "SMS Mail Merge Fields Function\nIn this article, you will learn the functionality of mail merge when creating an SMS Template.\nFollow these steps;\nGo to More\nSelect Settings\nClick on the SMS Template\nClick on the + sign to create a new SMS Template, then add a Template Title.\nMail Merge Functions\n<AppConfirm> - If you add this to the template, it will generate a link to the actual SMS received by the patient to confirm their appointment. This is how it looks when patient clicks on the link whenever they want to confirm their doctor's appointment.\n<AppDate> - This mail merge field indicates the date of the appointment\n<AppDuration> This mail merge field indicates the duration of the appointment, or how long the appointment will take.\n<AppLocation> When creating an appointment, the New Appointment Form will give an option to add a Room. When this has been added when creating the appointment and <AppLocation> mail merge is used on the template, the location/ room location of the provider is also indicated on the SMS sent to the patient.\n<AppTime> - This mail merge indicates the time of the appointment\n<AppTime24> - This indicates the time of appointment in Military Time, including the time zone.\n<AppTimePatientDate> - This mail merge field indicates the time of the appointment including the date of the appointment\n<AppTimePatientDate24> - This mail merge field indicates the time of appointment in Military Time with time zone including the date of appointment.\n<AppType> This indicates which kind or type of appointment the patient was booked under.\n<CoviuURL> If this mail merge is added to the template, a link or URL will be sent through the text message for the patient to access their Coviu Telehealth Appointment.\n<PatFirstName> Patient's First Name\n<PatFullName> Patient's Complete Name\n<PatSurname> Patient's Last Name\n<PracticeName> This indicates the name of the practice/ clinic\n<ProviderName> This indicates the name of the provider/doctor.\n  Now that you have learned each of their functions, click here to learn how to create an SMS Letter Template.\n "}