{"source": "https://support.medirecords.com/hc/en-us/articles/115001383191-Patient-Activities", "title": "Patient Activities", "body": "Patient Activities\nThis article will cover the basics of Patient Activities, and how to add, edit, and delete Clinical Actions and Tasks.\n\nWhere are Patient Activities Located?\n\nPatient Activities are located in the Activities tab of the patient record. To navigate to the Patients homepage, click Patients, which is the fifth tab on the MediRecords application ribbon.\n\nOpen a patient record, and click the Activities tab.\n\nThere are two main types of Activities for patients - Clinical Actions and Tasks - both of which are covered in the following parts of this tutorial.\n\nClinical Actions\nBy default, the Activities tab in the patient record opens on the Clinical Actions section. This page displays an overview of all clinical actions, their priority, status, and due date.\n\n\n\nTo filter which clinical actions you can see in a patient's record, click Filter to reveal a drop-down list of options. Click to filter clinical actions by their Status or by Owner.\n\nA Tick next to the name indicates that you can see clinical actions belonging to that category.\n\nTo search for clinical actions, click the Search Box and type in the first few letters of the Reason or Subject (for example, if you are looking for Pathology, type path). Press Enter.\n\nThe results of the closest matches will be displayed in the list below.\n\n\nTo print a summary of the clinical actions, click Print.\n\n\n\nA print preview will open. Check the job to make sure its going to the right Printer, select Pages, Layout, and Colour if necessary.\n\nClick Print to print the summary. \n\nTo Add a New Clinical Action, click New Clinical Action.\n\n\n\nThe new clinical action form will open.\n\nIf you are creating the activity for another doctor at your clinic, change the Owner field to that user's name. The system will then assign it to that user as an Activity.\n\nFill in the form with all the required details, and click Save.\n\n\n\nTo Edit a Clinical Action, click the Tick-box next to the name to reveal a list of options. Click Edit to open the activity for editing.\n\n\n\nEdit the Clinical Action as required and click Save to apply the changes.\n\n\n\nTo Delete a Clinical Action, click the Tick-box next to the name to reveal a list of options. Click Delete to permanently delete the activity from the patient's record.\n\n\n\nClick Yes to acknowledge the activity will be deleted.\n\n\n\nTo Delete Multiple Clinical Actions at once, click the Tick-box next to the names of the activities being deleted. When multiple activities are selected, Delete is the only available option. Click Delete to permanently the activities from the patient's record.\n\nClick Yes to acknowledge the activities will be deleted.\n\nIf you want to delete an activity, but still leave a record of the booking on the patient's record, you can cancel the activity instead.\n\nTo Cancel a Clinical Action, click the Tick-box next to the name to reveal a list of options.\nClick Status to reveal a drop-down list, click Cancelled to remove the activity, but keep a record of the booking on the patient's file.\n\n\n\nOnce an activity has been completed, it will need to be marked as completed. This closes the activity, removes it from the owner's calendar and keeps the record on the patient's file for future reference.\nTo Complete a Clinical Action, click the Tick-box next to the name to reveal a list of options. Click Status to reveal a drop-down list, click Completed to close the activity, remove it from the calendar, and keep a record of it on the patient's file. \nTasks\n\nTo view the list of Tasks within the Activities tab of a patient record, click Tasks. The tasks view displays a list of all tasks, their priority, status, and due date.\n\n\n\nJust like clinical actions, you can filter which tasks you see in a patient's record.\n\nTo apply a filter, click Filter to reveal a drop-down list of options. Click to filter tasks by their Status, Regarding, or by Owner.\n\nA Tick next to the name indicates that you can see clinical actions belonging to that category.\n\nTo search for tasks, click the Search Box and type in the first few letters of the Reason or Subject (for example, if you are looking for Referral, type refe). Press Enter.\n\nThe results of the closest matches will be displayed in the list below.\nTo print a summary of the tasks, click Print.\n\n\n\nA print preview will open. Check the job to make sure it's going to the right Printer, and select Pages, Layout, and Colour if necessary.\n\nClick Print to print the summary. \n\nTo Add a New Task, click New Task.\nThe new task form will open.\n\nIf you are creating the activity for another doctor or MediRecords user at your clinic, change the Owner field to that user's name. The system will then assign it to that user as an Activity.\nFill in the form with all the required details, and then click Save.\n\n\nTo Edit a task, click the Tick-box next to the name to reveal a list of options. Click Edit Task to open the activity for editing.\n\n\n\nEdit the task as required and click Save to apply the changes.\n\n\n\nTo Delete a Task, click the Tick-box next to the name to reveal a list of options. Click Delete to permanently delete the activity from the patient's record.\n\n\n\nClick Yes to acknowledge that the activity will be deleted.\n\nTo Delete Multiple Tasks at once, click the Tick-box next to the name of the activities being deleted. When multiple activities are selected, Delete is the only option available. Click Delete to permanently delete the activities from the patient's record.\n\nClick Yes to acknowledge that the activities will be deleted.\n\nIf you want to delete an activity, but still leave a record of the booking on the patient's record, you can Cancel the task instead.\n\nTo Cancel a Task, click the Tick-box next to the name to reveal a list of options. Click Status to reveal a drop-down list, click Cancelled to remove the activity, but keep a record of the booking on the patient's file.\n\n\n\nOnce an activity has been completed, it will need to marked as Completed in the patient's file. This closes the activity, removes it from the owners calendar, and keeps the record on the patient's file for future reference.\n\nTo Complete a Task, click the Tick-box next to the name to reveal a list of options. Click Status to reveal a drop-down list, click Completed to close the activity, remove it from the owner's calendar, and keep a record of it on the patient's file.\n\nTo export a list of tasks in Excel format (.xml), select the tasks you wish to export by clicking on the Tick-Boxes in the record (alternatively, to select all click the Top-most Tick-Box), click More, and Export.\nYou've completed another MediRecords Tutorial. You should now be able to access and use the Patient Activities tab effectively. If this is not what you're looking for, head back to our knowledge base and search for another article.\nFor urgent assistance, please contact MediRecords support on 1300 103 903 during business hours.\n "}