{"source": "https://support.medirecords.com/hc/en-us/articles/360000113515-How-to-Clear-your-Internet-Browser-s-Cache", "title": "How to Clear your Internet Browser's Cache?", "body": "What is an Internet Browser's Cache?\nNormally your internet browser (Google Chrome, Edge, etc.) downloads web pages and some, to all, of its content to your computer, usually in the folder Temporary Internet Files. This is the browser's cache. When you visit a webpage with files already downloaded in the cache, it will use them to load the page instead of re-downloading the page again. This allows the page to load faster and save some data from downloading.\nSometimes the cache can interfere with the normal use of the webpage and it needs to be cleared to be able to use it as intended.\nFor the first step of troubleshooting, you could try just clearing browsing data just for MediRecords.\nOn the MediRecords Home Page, navigate to the lock at the top of the page.\nClick on the Lock icon> select Cookies and Site Data\nSelect Manage Cookies and Site Data\nClick on the Trash Bin icon next to the Medirecords website\nSelect Done \nHow to clear your browser's cache for all sites?\nDepending on your internet browser, clearing your cache requires different steps.\nAndroid\nSelect Menu, then More.\nSelect Settings.\nUnder \"Privacy settings\", select Clear cache, Clear history, or Clear all cookie data as appropriate, and then OK to accept.\nChrome\nClick the 3 dots in the upper right corner of the browser.\nHover over the More Tools option then click Clear Browsing Data\nGo to Advanced Tab and choose All Time or a lesser time frame in the Time Range dropdown.\nSelect the items you want to clear (e.g., Browsing history, Download history, Cached images and files, Cookies, and other site data).\nClick Clear Data. \nEdge\nClick the 3 dots in the upper right corner of the browser.\nChoose Settings.\nUnder Cookies and Site Permissions, click on Manage and delete cookies and site data\nSelect See all cookies and site data\nClick Remove All and select Clear\nNOTE: MediRecords supports the use of Chrome and Edge Chromium browsers.\nPlease be advised that use with other browsers may cause performance issues. "}