{"source": "https://support.medirecords.com/hc/en-us/articles/360000174455-Patient-Record-Overview", "title": "Patient Record Overview", "body": "This article will provide an overview of the Patient Record and its main features.\n  When opening a patient record, the following will be displayed.\n  1. Patient Photo\nA photo of the patient uploaded onto MediRecords by the patient via the MediRecords app, or by a MediRecords user.\nTo add or edit a photo, move your mouse cursor over the photo and click Update Patient Photo.\n  2. Patient Basic Information\nBasic information about the patient including their Full Name with Aliases, Date of Birth (DOB), Gender, Address, and Phone Number. \nThe Record Status (Active or Inactive) of the patient can be seen next to the Gender.\n  3. Allergies and Reactions (Clinical & Integrated Subscription)\nA summary of any adverse allergies or reactions the patient has. \nTo modify the summary, click the Plus Icon (+). \n  4. Task and Clinical Action\nWhere you can add a Task and Clinical Action.\n  5. Patient Record Tabs\nDashboard\nProvides a summary of key clinical information such as Current Medication, Medical History, Immunisations, Investigations, Preventative Health, and Current Chats about the Patient.\nProvides a Quick Action Bar that provides easy access to common actions, such as writing a New Referral or a Pathology Request.\nDetails\nProvides detailed information about the Patient's Demographic and Social Details, Tobacco, Alcohol and Medical History, and Medicare, DVA, Pension, and Health Fund details.\nClinical (Clinical & Integrated Subscription)\nProvides a note-taking feature for consults.\nAccess to detailed Clinical Information about the Patient such as Medical History, Ongoing Treatments, and Correspondence.\nAccounts (Practice Management & Integrated Subscription) \nProvides a record of Quotes, Invoices, Past Payments by the Patient, and Adjustments made.\nActivities\nProvides a log of any Tasks and Clinical Actions set regarding the Patient (e.g. Contact Patient about an upcoming appointment / Examine a test result).\nAudit\nProvides a log of changes to the record and any requests for patient information for external use (e.g. Medicare information for a claim)\n  6. Patient Type\nA selectable category of patient types that can be filtered through the Appointments Calendar.\n  7. Usual Provider\nThe patient's preferred provider.\n  8. Usual Practice\nThe patient's preferred practice.\n  9. New Chat\nThis will open a new chat window in regards to the patient.\n  Additionally, App Invite will send an invite to sign up for the MediRecords Smartphone App via SMS to the mobile phone number listed in the patient record if the patient is not connected yet."}