{"source": "https://support.medirecords.com/hc/en-us/articles/4411778799631-How-do-I-create-a-Session", "title": "How do I create a Session", "body": "Sessions allow you to customize the calendar availability for both your practice and individual providers; this not only reflects their actual practice hours but can also include meal breaks, half-days, and off-site work (e.g. home visits). This allows you to accurately show who is available for that day. \n\nHow do I Create a New Community Session?\nA Community Session shows on the MediRecords Patient App and Appointment Widget, allowing your patients to book their own appointments online.  The session times that you have made available to the community will be shown as available for booking. You can customise your practice and session times to reflect the times you wish to make available to patients to book. \nFollow these steps to create a new Community session:\nClick the More tab and select Settings from the drop-down menu\nClick Appointments\nSelect the clinic you wish to make the session for\nClick Sessions\nClick New Session to open the session form\nClick Calendar and select Community.\nTo access sessions, click More and select Settings.\nFill in all the session details as required;\nClick Save to create the new session.\nThe new session has now been created, and the availability times will be listed within MediRecords Community, and visible on the MediRecords Patient App and MediRecords Appointment Widget\n  How do I Create a New Practice Session?\nPractice Sessions set the framework for appointments in your Clinic. Practice sessions are available only to those working in the Practice.\nFollow these steps to create a new Practice session:\nClick the More tab and select Settings from the drop-down menu\nClick Appointments\nSelect the clinic\nClick Sessions\nClick New Sessions to open the session form  \nFill in all the session details as required\nClick Save to create a new session\nThe new Practice session has now been created. \nFor assistance, please contact MediRecords support on 1300 103 903 during business hours OR Email - Support@medirecords.com\n     "}