{"source": "https://support.medirecords.com/hc/en-us/articles/115001661092-Welcome-to-the-MediRecords-Items", "title": "Welcome to the MediRecords Items", "body": "Welcome to the MediRecords Items \n\nThis article has been written to give new users an informative overview of Items functionality in  MediRecords.\n\nIf you are looking for a specific work instruction or function, try looking at the Frequently Asked Questions within the Schedules & Items Settings Support Page. Each of these articles contains a detailed work instruction relative to the topic.\n\nThe settings for Items are located within the Accounts section of the Settings page of  MediRecords. To open Settings, click More to reveal a drop-down list, and click Settings.   \n\n\n\nClick Accounts.\n\n\nClick Items.\n\n\nThe Items homepage displays a list of all items, belonging to all fee schedules.\n\nTo quickly view a summary of item, including the full description and charges, click the > next to the item name to reveal the Item Summary.\n\n\n\nTo sort the items by Item Number, Name, Schedule Name or anything else, click on the Column Heading to sort in ascending order. Click again to switch to descending order.\n\n\nTo view only items from a specific schedule, click Filter, then click the Schedule Name.\n\n\n\nThe list now only displays the items from the selected schedule.\n\nTo Add a New Item to a Custom schedule, click New Item.\n\n\n\n*Note: New items can only be added to Custom schedules. New item cannot be added to system-created schedules, like MBS or DVA*\n\nClick Schedule to select the custom schedule, and then click Item Number and give the item a unique code.\n\nComplete all additional fields as required and then click Save.\n\nTo Edit an Item, click the Tick-box next to the item name to reveal a list of additional options for items. \n\n*Note: Only items in Custom schedules can be edited. Items in system-created schedules, like MBS or DVA, cannot be edited*\n\nClick Edit Item to edit the item.\n\n\nUpdate all the required fields, and then click Save.\n\n\nTo Delete an Item, click the Tick-box next to the item name to reveal a list of additional options for items. \n\n*Note: Only items in Custom schedules can be deleted. Items in system-created schedules, like MBS or DVA, cannot be deleted*\n\nClick Delete Item to delete the item.\n\n\n\nClick Yes to acknowledge that the item will be deleted.\n\n\n\nTo Change the Status of an item, lick the Tick-box next to the item name to reveal a list of additional options for items.\n\nClick Status and then click Activate or Deactivate."}