{"source": "https://support.medirecords.com/hc/en-us/articles/360000231856-Editing-or-Removing-Existing-Appointment-Types", "title": "Editing or Removing Existing Appointment Types", "body": "Editing or Removing Existing Appointment Types\n  MediRecords has 23 default appointment types that are available for use. Although you cannot create new appointment types, you have the ability to edit or change the active status of these appointment types to suit your practice needs.\nFollow these steps to Edit or Remove Existing Appointment Types\nGo to More\nClick Settings\nSelect Appointments\nWithin Appointments, click on the practice that you wish to edit the appointment types. \nClick on Appointment Types.\n\nYou will be taken to the Appointment Types screen as shown. This article will now focus on the two functions.\n\nEditing Appointment Types\n\nTo make changes to an existing appointment category, simply select the tile you wish to modify.\n\nA small window will pop up with the details of that type. You have the option to change the Icon, Name, Duration, Colour, Active Status, and Community Status.\nThe Colour will determine what colour the appointment will appear as when viewed from the Appointment Calendar if Colour Palette is selected as Type. This is available via the Practice section.\nNOTE: Completed appointments will always appear as their Status colour. For more information about appointment statuses, please refer to our article here.\nNOTE: Community Status determines whether the appointment type is available for patients to select from the MediRecords Online Appointments or Patient App.\n\nIf you change the duration of this appointment type, you will be greeted with a message explaining that this will not impact existing appointments made with that specific type. Click OK to proceed.\n\n\nIn this example, the Procedural Consultation type has been edited to the following.\n\nClick Save when you have finished with the changes, or Cancel to revert the changes back to the previous information.\n\nRemoving Appointment Types\n\nWhile you cannot delete these Appointment Types, you have the option to change their active status. Simply select the tile you wish to modify.\n\nWhen the appointment type form shows, uncheck the Active box and click Save.\nYou will be greeted with the following warning message. Click Yes to proceed or No to cancel.\n\nIf you click Yes, the type is now Inactive. \n\nTo make a type active again, change the filter to view Inactive appointment types only. Do this by clicking the Filter and select Inactive. Be sure to de-select Active as shown.\n\nYour screen will now show Inactive appointment types only. Similar to the process before, check the Active box and click Save.\n\nYou will be greeted with the following warning message. Click Yes to proceed or No to cancel.\n\n\nIf you click Yes, the type has now been made Active again.\nConfiguring Telehealth Appointments"}