{"source": "https://support.medirecords.com/hc/en-us/articles/4906969639055-Create-a-Custom-Invoice-Template", "title": "Create a Custom Invoice Template", "body": "This article is going to walk you through how to create a new template for invoice quotes and receipts. \nThis article can benefit Practices who wish to add their banking details to invoices for patients to have an extra way to pay.\n\nGather data for a new template\nThe easiest way we have found when you want to create your template is to copy another template and paste that data into a new template and just add to it to make it unique to the Provider or practice.\nNavigate to More > Recourses > Letter Templates.\nIn the search bar input Invoice and search.\nYou will be displayed with a list of matches please select the share column to ensure all Community set invoice templates are all showing together (Community lets you know that this is the template MediRecords has provided):\nTick the box next to the invoice template you want to copy\nSelect Preview > Copy the entire template\nIf needed paste this info in another document (WORD for example) to keep a record of it and not lose it > Close out of this template screen. \n  Creating the New Invoice Template\nIn More > Recourses > Letter Templates > Select New Letter Template.\nA Pop-up will appear for you to fill out the type of Template you want to create, fill out each field in the pop-up correctly to ensure it is easy to locate. \nCategory: Billing\nType: This will depend on the type of invoice you want to create whether it is an invoice with or without tax (STD invoice) or an In-patient quote billing to either the patient or Heath Fund.*\nSharing: Practice\nName: Give your new invoice quote an easy-to-locate name.\nDescription: Describe the type of template it is.\nThe example shown below of how to fill out this pop-up specifically for Billing templates. 4. After you have filled out the invoice details, select Save\n5. You will then be able to start editing/creating a new custom invoice template > Paste all of the information copied from the original invoice template.\n6. After you have pasted all of the information needed for this invoice template you can then add to it to make it customised to that provider or practice. \n7. As shown above, the highlighted part is an example of information providers want to be added to an invoice quote > once everything is added to the template ensure it is all saved and close out of this window. \n\n\nAssigning the new template to Provider's Preferences\nAfter the template has been created you will need to assign it to either that specific provider or All providers.\nMore > Settings > Subscription Details > Users > Search relevant User > tick box next to their name > Configure > Invoices: \nDepending on the type of invoice you created and whether it was saved as a Standard invoice with Tax or an In-Patient Invoice bill to Patient template, you will select that drop down and then that newly created template will appear to select and then ensure to Save. \n4. We recommend trialing this out on a test patient and creating a test invoice that will use this specific new template and see if it displays the way you want. \n\nYou've completed another MediRecords Tutorial. You should now be able to create a new user in your practice. If this is not what you're looking for, head back to our knowledge base and search for another article.\nFor urgent assistance, please contact MediRecords support on 1300 103 903 during business hours."}