{"source": "https://support.medirecords.com/hc/en-us/articles/360000237275-Your-Secure-Messaging-Inbox", "title": "Your Secure Messaging Inbox", "body": "Your Secure Messaging Inbox\n  This inbox is used to receive results for patients, securely contact other providers, and to view scanned documents assigned to you via the Bulk Scan Upload\n\n*NOTE: Inbox is part of the Clinical module and is only visible when you have either a Clinical or an Integrated subscription to MediRecords. \nTo open Messaging, click the Mailbox Icon, which is the seventh tab on the MediRecords Application Ribbon.\nThe Inbox can also be opened directly from the Home Tab. Click View underneath the Lab Results Counter.\nThe Inbox stores all secure messages that have been linked to a patient and allocated to you. Messages will stay in the Inbox until reviewed and then formally closed. Once a message has been checked, it will be stored in Correspondence in patient's clinical record, where it can be retrieved and reviewed at a later date. Once a result is checked it will be stored in Investigations.\nTo filter the list of messages, click Filter to reveal a drop-down list, and select a filter under Type, Status, Provider or When. You can select more than one filter; Active filters will have a blue tick.\nTo search for a message, click the Search-box and type in a Keyword from the Subject / Request name. Press Enter and system will a list of the closest matches. You can also search using keywords from Patient Name, To and From.\nTo link a result message to an existing request that is awaiting results in the patient's clinical record, click Link to Request. The message will expand to display a list of all outstanding requests for the patient.\nClick the Tick-box next to the name of the open request and click Partially Received or Fully Received.\nTo open the patient record, click More to reveal a drop-down list, and click Open Patient.\nTo create a new patient from the message, click More to reveal a drop-down list, and click Create New Patient to open a new patient form.\nTo flag the message as patient notified, click More to reveal a drop-down list, and click Patient Notified.\nTo flag a message as confidential, click More to reveal a drop-down list, and click Flag as Confidential.\nTo create an activity from the message, click More to reveal a drop-down list, and click Create Activity to open an activity form.\nTo print the message, click More to reveal a drop-down list, and click Print to open a print preview.\nTo delete the message, click More to reveal a drop-down list, and click Delete to permanently delete the message. Click Yes to acknowledge the message will be deleted.\nTo add details of the patient's INR, click INR to open the INR form. \nTo add detail of a Pap Smear (cervical smear), click PS to open the cervical smear form. Patient must be listed in MediRecords as female for this option to appear.\nTo create a Task regarding a patient, click the Task Icon to open the task form. Click Save when details have been filled.\nTo create a Clinical Action regarding the patient (e.g. Recall), click the Clinical Action Icon to open the form. Similar to Tasks, click Save when done.\nTo book a new appointment for the patient, click the Calendar icon to open an appointment form.\nTo send an SMS to the patient, click the SMS icon to open the SMS On Demand form."}