{"source": "https://support.medirecords.com/hc/en-us/articles/360000903595-Sharing-a-Patient-s-Updated-Clinical-File-to-My-Health-Record", "title": "Sharing a Patient's Updated Clinical File to My Health Record", "body": "Sharing a Patient's Updated Clinical File to My Health Record\n  MediRecords allows you to share clinical information from the patient record to their linked My Health Record. This tutorial will demonstrate the functions you can use to manage this. \n\n\n\nThere are two types of documents you can upload to a patient's My Health Record: a Shared Health Summary, and an Event Summary.\nEach of these document types will be covered individually in this two-part article  \nPart 1: Shared Health Summary\n\nA Shared Health Summary is an auto-generated document that summarises some or all of the patient's existing conditions, medications, and medical history. These are done in accordance with the Australian National Healthcare Standard for Shared Health Summaries.\n*NOTE: You cannot add information to a Shared Health Summary that is not already recorded in MediRecords. \n\nWhen you are creating new Medications or recording Medical History about a patient, you can flag the record to automatically be imported into the next Shared Health Summary that gets uploaded into the patient's My Health Record.\n\nTo flag a new medication, so that it gets added to My Health Record summaries, click the My Health Record Consent button, so that the Tick is highlighted.\n\n\nTo flag medical history, so that it gets added to My Health Record summaries, click the Send to My Health Record button, so that the Tick is highlighted.\n\n\n\nTo create a shared health summary, navigate to the patient's My Health Record by clicking the MHR Icon in the quick action toolbar in the patient's Clinical record.\n\n1. Click New Document to reveal a drop-down list, and click Shared Health Summary to open the health summary form.\n\n\n\n2. To add information to the health summary, click the Tick-boxes next to the name of the Clinical Information that you want to add. We have ticked the following to demonstrate.\n\n3. You will be shown a disclaimer message. Click Upload to proceed.\n\n\n\n4. Your new Shared Health Summary will now be visible for viewing.\n\n\n\n\nPart 2: Event Summary\n\nMy Health Record Event Summaries relate to the events that occurred on the day of the visit (today), and do not typically include historical active medications, conditions, or allergies.\n\n1. Click New Document to reveal a drop-down list, and click Event Summary to open the event summary form.\n\n\n\n2. Similar to the Shared Health Summary, click the Tick-boxes next to the name of the Clinical Information that you want to add. We have ticked the following to demonstrate. Click Save when you have finished.\n\n\n\n3. You will be shown a disclaimer message. Click Upload to proceed.\n\n \n\n4. Your new event summary is now visible in the My Health Record section.\n\n\nFor urgent assistance, please contact MediRecords support on 1300 103 903 during business hours."}