{"title": "Your MediRecords Home Page - Overview", "body": "Welcome to the MediRecords Home Page! \n\nThis article has been written to give new users an informative overview of the MediRecords Home page. In this tutorial, you will learn how to navigate and use the applications available in the MediRecords Home page - the Dashboard, Instant Chat, the Notice Board and a Shortcuts Toolbar.\n\nIf you are looking for a specific work instruction or function, try looking at the Frequently Asked Questions within the Home Page Support Page. Each of these articles contains a detailed work instruction relative to the topic.\n\nHome Page - Overview\nThe Home Page is the first tab on the MediRecords application ribbon.\n\n\n\nThe Home page contains a dashboard that summarizes appointments, consultations, and other important activities occurring within your clinic. The home page also hosts instant chat, a notice board, and a shortcuts toolbar. \n\nThe Dashboard\nThe Dashboard displays important, live, up-to-date information about activities going on within your clinic. You can use the MediRecords Dashboard to create new appointments and to navigate to related applications that are displayed on the MediRecords Dashboard.\n\n\n\nInstant Chat\nInstant Chat in MediRecords allows you chat with other users registered on your subscription, even if they work at another site. In addition to this, once a provider has published their profile with the MediRecords Community, you can use instant chat to other members of the community.\n\n\n\nNOTE: Instant Chat has its own support page. Please click here to access the support articles for Instant Chat within the Knowledge Base.\n\nThe Notice Board\nThe Notice Board is used for posting live messages to the other staff within the clinic, saving the need for internal emails, phone calls, or messages being relayed verbally.\n   Shortcuts Toolbar\nThe Shortcuts Toolbar allows you to quickly search for a patient, create a new patient record, appointment, clinical action or task.\n\nNOTE: The Shortcuts Toolbar has its own support page. Please click here to access the support articles for the Shortcuts Toolbar within the knowledge base.\n\nMediRecords Shortcuts Toolbar"}