{"title": "August 2022 Product Update", "body": "Consent Module \nWe are excited to announce a product update being released tonight, the Consent Module. MediRecords’ Consent Module has the flexibility to record patient consent for various procedure types or investigations. It shows exactly what the patient has provided consent for or rejected. This includes concepts such as Advanced Care Directives, information disclosure to third parties, acceptance of privacy policies, and more.\nYou can open this new feature via a new tab at the top of the patient record, for quick viewing access.\nTo learn more about the Consent Module and how you can implement it for your business, click the button below to access our Knowledge Base article or contact our friendly Support team.  \nRead more.\n  Custom Fields\nCustom Fields will allow you to create, capture and then search for custom information about your patients - such as where they were referred to you from, who recommended them and what treatment plan they are following. This feature is designed to make collecting and recording patient data relevant to your business much easier.\nRead more.\n  PRODA Web Services\nThese were originally announced in May but delayed due to updated requirements including the introduction of OEC (Online Eligibility Checks).\nUpon release, all customers will have the option to be moved over to the MediRecords vendor PKI certificate. This will be a managed service provided by MediRecords.\nOnce available, MediRecords customers will receive the added benefits of Webservices over the existing Medicare Service Adaptor:\nClaim IDs generated by Medicare: All claims with a Claim ID will have been received by Medicare\nClaim Submission Summary Update: New fields include Service Provider, Payee Provider, Facility ID (if applicable) and Service Type\nPCS Removed: All Patient Claims will be submitted in real-time\nAIR Claiming: Country and School ID codes will now be included in AIR Claim submissions.\nRead more."}