{"title": "Connecting to the Health Identifiers Service", "body": "This article will cover how to set up for the Health Identifiers service for the purpose of connecting to My Health Record and eRx e-prescribing. \nPrerequisites \nYou will need:\nHPI-O number - (Healthcare Provider Identifier for organisations that deliver health care (such as hospitals or general practices).\nProvider HPI-I numbers - ( Healthcare professionals involved in providing patient care )\n1. Register your organisation in the HI Service to obtain an HPI-O number. Click here to see how to apply. \n2. Obtain a copy of all of your provider's HPI-I numbers. \n*NOTE: If you cannot locate your doctor's HPI-I number, they can contact either HPOS or APHRA to obtain a copy of their 16-digit HPI-I number.  \nPart 1A: Health Identifier Configuration\nClick More to reveal a drop-down list. Select Settings, then click on Configuration Settings.\nClick the Practice Name.\nClick Health Identifier\nClick PIC - Personal Identification Code and enter your certificate PIC. \nTo upload your NASH Certificate, click Select File to open a file explorer window. Navigate to the location of your NASH Certificate and select it for upload.\nOnce the certificate has been saved, the Certificate Alias Name and the Expiry Date will automatically be populated on the form.\nPart 1B: eHealth Configuration\nYou will now need to upload your NASH Certificate to the eHealth section of Practice Configuration.\nClick eHealth.\nClick PIC - Personal Identification Code and enter your certificate PIC.\nUpload your NASH Certificate > Click Select File to open a file explorer window and navigate to the location of your NASH Certificate and select it for upload.\nOnce the file has been uploaded, the practice's HPI-O Number will automatically be populated to the HPI-O No. field, along with a Certificate Alias Name and Expiry Date, which are all digitally stored on the NASH certificate.\nPart 2: Provider Configuration\nIn order for providers to connect to the Health Identifiers Service through MediRecords, they must have their 16-digit HPI-I Number recorded into their profile. If a doctor does not have the HPI-I Number recorded against their profile, they will not be able to access My Health Record or prescribe with eRx.\nThe HPI-I Number is added to the Identifiers section of the user profile, within User Settings.\nClick More to reveal a drop-down list. Click Settings and then click on Subscription Details.\nClick Users.\nClick the Name of the provider to open the user settings.\nClick Identifiers and go to HPI-I No. field and type in the 16-digit HPI-I Number. Click Save to apply the changes.\nThe provider has now been configured to allow access to My Health Record. Repeat this process for any additional providers, and for any new providers that join the clinic in the future."}