{"title": "My Health Record - Additional MHR Views", "body": "In this article My Health Record additional Views, you learn to navigate the additional views available within My Health Record.\n\nIn addition to the patient summaries (covered in part three) there are also four additional My Health Record views available in MediRecords.\nMedicare Overview\nNPDV (National Prescription and Dispense View)\nDiagnostic Imaging View\nPathology View\nEach of these views will be covered individually in this tutorial.\n\nMedicare Overview\n\nThe Medicare Overview summarises all of the patient's MBS, PBS and ACIR data.\n\nTo open the Medicare Overview, click Medicare Overview.\n\n\n\nBy default, the Medicare Overview initially displays the last two years worth of data. However this range can be expanded or reduced by adjusting the From and To dates, and then clicking Get View.\n\n\n\nTo view any of the Medicare Services listed in further detail, click the Description of the open details of the service.\n\n \n\nTo print the Medicare Overview, click Print to open a print preview.\n\n\n\nCheck to make sure that page is going to correct printer Destination, and the Layout matches the page formatting, and then click Print.\n\n\n\nNPDV (National Prescription and Dispense View)\n\nThe NPDV summaries all the prescriptions that have been dispensed to the patient from a pharmacy. This includes both private prescriptions, and prescriptions subsidised by the MBS.\n\nTo open the National Prescription and Dispense View, click NPDV.\n\n\n\nBy default, the NPDV initially displays the last two years worth of data. However this range can be expanded or reduced by adjusting the From and To dates, and then clicking Get View.\n\n\n\nTo change the grouping of the prescriptions, click Group to reveal a drop-down list, and then select a grouping option from the list.\n\n\n\nTo view any of the NPDV items listed in further detail, click the Medicine Details to expand the details of the medicine in the grid below.\n\n\n\nFrom the expanded medicine view, you can view details of individual prescriptions that have been dispensed. To view the details of a prescription, click the Name of the Prescription.\n\n\n   "}