{"title": "My Health Record Configuration & Setup", "body": "MediRecords has integration with the My Health Record. In this article, you will learn how to set up and configure your practice and providers to connect to My Health Record.\n\nPrerequisites\nBefore you can connect to My Health Record, you need to register your practice with Medicare obtain access to the Health Identifier (HI) Service and obtain the Health Professional Identifier - Organisation (HPI-O) number.\n\nAccess to the HI Service - which requires both a HI Certificate and a NASH certificate - is required to access My Health Record.  \n\n1. You will need to complete the Healthcare Organisation registration form on the My Health Record website. Applications can be completed either online or by mail. Once you have completed registration, you will be provided with an HPI-O Number and a NASH Certificate which needs to be uploaded to your practice profile in MediRecords.  \n\n2. Obtain a copy of all of your provider's HPI-I numbers. To use My Health Record, all doctors must have an HPI-I number recorded against their user profile in MediRecords. If the HPI-I number is not recorded, then that doctor will not have access to My Health Record.\n\n*NOTE: If you cannot locate your doctor's HPI-I number, they can contact either HPOS or APHRA to obtain a copy of their 16-digit HPI-I number.  \n\nOnce you have the HI and NASH certificates with their passphrases, the HPI-O number for your practice along with your providers' HPI-I numbers, you can configure your practice settings and users to connect to My Health Record.\n\nPart 1A: Practice Configuration - HI Certificates\n\nTo begin setting up My Health Record, you will need to upload your Health Identifier PKI Certificate to your practice profile in MediRecords, within the Health Identifiers section of Practice Configuration.\n1. Go to More\n2. Click Settings\n3. Click Configuration Settings\n4. Click the Practice Name\n5. Click Health Identifier\n6. On Certificate Passphrase (also known as PIC) enter your HI Certificate passphrase\n7. To upload your HI Certificate, click Select File to open a file explorer window.\nNavigate to the location of your HI Certificate (only select the one called fac_sign.p12) and select it for upload.\n8. Once the certificate has been saved, the Certificate Alias Name and the Expiry Date will automatically be populated on the form.\n9. Click Save\n\n\n\nPart 1B: Practice Configuration - NASH Certificates\n\nYou will now need to upload your NASH Certificate to your practice profile in MediRecords, within Practice Configuration in Settings.\n\n1. Click eHealth\n2. Click Passphrase (PIC) and enter the passphrase that you received with your NASH Certificate.\n3. To upload your NASH Certificate, click Select File to open a file explorer window.\n4. Navigate to the location of the certificate (typically it will be stored on a CD, which was provided by Medicare), click on the name of the certificate (called fac_sign.p12) and upload. \n5. Once the file has been uploaded, the practice's HPI-O Number will automatically be populated to the HPI-O No. field, along with a Certificate Alias Name and Expiry Date, which are all digitally stored on the NASH certificate.\n6. Click Save\nPractice configuration for My Health Record is now complete.\n\nPart 2: Provider Configuration\n\nFor providers to use My Health Record, they must have their 16-digit HPI-I Number recorded into their profile. If a doctor does not have the HPI-I Number recorded against their profile, they will not be able to access My Health Record.\n\nThe HPI-I Number is added to the Identifiers section of the user profile, within User Settings.\n1. Go to More\n2. Click Settings\n3. Click Subscription Details\n4. Click Username\n5. Click Identifiers.\n6. Click HPI-I No. and type in the 16-digit HPI-I Number.\n7. Click Save to apply the changes. ￼\n\nThe provider has now been configured to allow access to My Health Record. Repeat this process for any additional providers, and for any new providers that join the clinic in the future.\n\nYou've completed another MediRecords Tutorial. You should now be able to configure your practice to access My Health Record. If this is not what you're looking for, head back to our knowledge base and search for another article.\n      If you need further assistance please contact support on 1300 103 903 or email at support@medirecords.com"}