{"title": "Managing Existing Service Provider Contacts", "body": "Managing Existing Service Provider Contacts\nIn addition to storing a wide variety of contact data on service providers, MediRecords offers several functions you can use to manage them. This tutorial will provide a concise explanation of each feature.\n\nWhen you check the box of one contact, the following options appear. You also have the Search bar on the right to find contacts quickly.\n  Open\nYou can only open one contact at a time. Check the box next to a contact and click Open.\nYou will be brought to the profile of the contact. If the Share level is Private or Practice, you will be able to edit.\n\n\n\nDepending on the Share level, the profile may display as read-only. For example, if we try to open this contact whose Share level is Global Contact.\n\n\n\nWe will get a read-only profile as shown.\n  Delete\nYou can only delete contacts you have created. To delete a contact, check the box next to the name and select Delete.\n*NOTE: This is a permanent action and cannot be reversed.\nYou will be shown a warning message.\nClick Yes if you wish to proceed. \n\nSearch\nClick the search field and type in a search term - this can match the Name, Provider Type, Suburb/City, State, Phone, and/or Email.\n\nFor example, we will search \"Pathology\". Enter the term and click the search icon. Alternatively, hit Enter or Return on your keyboard.\nThis will list all contacts that match this term.\n\nLetter\nYou can send a letter to one contact at a time. Check the box next to the contact, click More, and select Letter.\n\nYou will be taken to the New Letter window. Fill this out as needed.\n  Create Task\nYou can create a task regarding the contact. Check the box next to the contact, click More, and select Create Task.\n\nThe New Task form will show. Fill this out and click Save.\n  Deactivate/Activate\nYou can change the active status of one or more contacts. Check the box next to the contact name, click on Status, and select Deactivate.\n\nThe contacts will now be Inactive. To reactivate, change the Filter to display Inactive contacts only - make sure you de-select Active. \n\nSimilar to deactivation, check the box, click Status, and select Activate.\nThe contact will now be Active again."}