{"title": "Creating a New Schedule", "body": "Creating a New Schedule\n  In MediRecords, you have the option to create your own custom schedules for providers to bill patients. This article will demonstrate this function.\n\nClick on More and select Settings.\nClick on Accounts\nSelect Schedules.\n\n\nYou will be brought to the Schedules list on MediRecords.\n\n\n\nTo create a new schedule, click on the New Schedule button.\n\n\n\nThe New Schedule form will pop up. \n\n\n\nOf particular note is the Schedule Type field. You have three options:\nMBS Derived - Uses the MBS item codes and fee schedule, with options to apply a fixed margin (either dollar value or percentage) and rounding values on the MBS fees.\n\nMBS Custom - Uses the MBS item codes, however each item is assigned a custom fee.\n\nCustom - A custom fee schedule with unique item codes, unrelated to MBS.\n\n\n\n\nMBS Derived\n\nIn the form, select MBS Derived. You will be shown the following fields.\n\n\n\nIn this example, we will modify the schedule so that MBS items are charged 5% more than their default value. Click on the field and adjust to \"5.00\".\n\nYou can also customise whether the values should be rounded, and by what increment. In this example, we are rounding the items to the nearest dollar.\n\nIt is optional to edit the Valid To date on the schedule. In this tutorial, we will set it to a few days after the Valid From date.\n\nOnce all relevant details have been filled in, click on Save.\n\nMBS Custom\n\nIn this form, you will only need to fill out the Name, Code and Description. The following schedule has been filled in for example.\n\n\n\nClick Save when you have filled in the details.\n\nCustom\n\nSimilar to MBS Custom, you will only need to fill out the Name, Code and Description. The following schedule has been filled in for an example.\n\n\n\nClick Save once you have filled out the details.\n  Need Assistance contact MediRecords support on 1300 103 903 during business hours \nOR\nEmail Support@medirecords.com \n "}