{"title": "Medicare - Patient Verification (OPV & OVV)", "body": "In this article Medicare Patient Verification, you will learn how to verify a patient's government healthcare card using Online Patient Verification (OPV) for Medicare cards, and Online Veterans Verification (OVV) for Dept. of Veterans Affairs card. OPV and OVV will be covered separately in this tutorial.\n\nMedicare Online Patient Verification (OPV)\n\nSubmitting an OPV request for each-and-every patient that has a Medicare card is very important. By verifying that your patient information matches the patient's identity within the Medicare database ensures that Medicare claims will be processed smoothly and without delay.\n\nYou can submit an OPV request from within Patient Details, the Patients List, and when you are creating a new Invoice in Patient Accounts. You can also submit an OPV request from within a patient booking in the the Appointments Calendar. Each of these methods will be covered individually in this tutorial.\nIf verification has not been run for Medicare or DVA patients within 7 days of processing an invoice, the claim  will sit in the Unclaimed Amounts section of the Claiming tab until a check has been successfully run.\n\nPatient Details\nTo submit an OPV request from within Patient Details, open a patient record, navigate to the Details tab and click Settings.\nCheck to make sure the Medicare Card No. is up-to-date, and then click OPV. *NOTE: After an OPV request has been submitted, it takes Medicare approx. 10 to 15 seconds to respond. Please be patient while waiting for Medicare to respond, and do not close or refresh your browser during this process.\nOnce the OPV has been processed, and Medicare has responded to the request, the system will issue a notification as to whether the OPV was complete, or if it failed.\nWhen an OPV request is successful, and the Medicare Card No. has been validated, click OK to close the notification and return to the patient record. When an OPV request has failed, the data submitted cannot be validated by Medicare. Click OK to close the notification and check the patient's First Name, Last Name, DOB and Medicare No. before submitting another OPV request.\nTo check the date and outcome of the last OPV request that was submitted, hover your mouse over the \"i\" icon next to the OPV button. When the mouse cursor changes into a Finger Pointer, the details of the last OPV results will pop-out next to the icon.\nThe OPV results bubble will display whether or not the OPV identity-check was Completed or Failed.\n\nPatients List\nTo submit an OPV request from the Patients List, navigate to the Patients section of MediRecords.\nClick the Tick-box next to the name of the patient you want to verify and click OPV to submit the request to Medicare.\nTo submit multiple OPV requests at once, for multiple patients, click the Tick-boxes next to the patient names and click OPV to submit the requests to Medicare.\nTo submit an OPV request for all patient names displayed in the patient list, click the \"Select All\" tick-box in the top left-hand corner to select all patients displayed in the list. Click OPV to submit the requests to Medicare.\n*NOTE: Clicking \"Select All\" only selects the patient's displayed on the page. If you have multiple pages in your patient list, and you want to run an OPV check on all of them, you will need to navigate through the pages and click \"Select All\" and submit OPV requests separately for each page of the patient list.\nWhen an OPV request fails, because the patient's data could not be validated by Medicare, the record in the patient list will be flagged as \"OPV Failed\". The system will place a Red Border around the patient's Medicare number and Expiry date when the record is flagged as \"OPV Failed\".\nTo view a detailed description of why OPV failed, hover your mouse over either Medicare no. or Expiry. When the mouse cursor changes into a Finger Pointer, the details of the failed OPV results will pop-out to the right or left. \nThe \"OPV Failed\" flag does not prohibit or restrict any activities in the patient's record. You can still book appointments, update details, prescribe, add clinical information, create and assign activities and process accounts. The flag is in place so that you easily identify when a patient's OPV identity-check has failed, and it's likely that Medicare claims for that patient could be held-up or rejected.\n  Patient Accounts - Invoices\nTo submit an OPV request whilst creating an Invoice (prior to billing) in Patient Accounts, navigate to top left-hand corner of the invoice form. Hover your mouse over the \"i\" icon above the patient's name. When the mouse cursor changes into a Finger Pointer, a summary of the patient's healthcare cards will pop-out to the right.\nClick OPV to submit the OPV request to Medicare.\nThe OPV request is processed the same way in Invoices as it is in the patient record. Once the OPV request has been submitted, it takes Medicare approx. 10 to 15 seconds to respond. Please be patient while waiting for Medicare to respond, and do not close or refresh your browser during this process.\nOnce the OPV has been processed, and Medicare has responded to the request, the system will issue a notification as to whether the OPV was complete, or if it failed. \nWhen an OPV is successful and the Medicare Card No. has been validated, click OK to close the notification and process the invoice payment / claim.\nWhen an OPV request fails, and the data submitted cannot be validated by Medicare, click OK to close the notification. Check the patient's First Name, Last Name, DOB and update their Medicare No. before submitting another OPV request.\nIf you decide to finalise the invoice and submit a claim for patient who's OPV identity-check failed, you will receive a notification that the claim as failed in your Medicare claims reporting page.\nAppointment Calendar\nBooking an appointment will automatically run an OPV check on the patients' details.\nA manual OPV request from the Appointment Calendar can also be run by clicking the Timeslot assigned to the patient in the appointment calendar to open the booking form.\nClick More to reveal a drop-down list. Click OPV Check to submit the OPV request to Medicare. \n\nThe OPV request is processed the same way in the Appointment Calendar as it is in invoicing and in the patient record. Once the OPV request has been submitted, it takes Medicare approx. 10 to 15 seconds to respond. Please be patient while waiting for Medicare to respond, and do not close or refresh your browser during this process.\nOnce the OPV has been processed, and Medicare has responded to the request, the system will issue a notification as to whether the OPV was complete, or if it failed.\nWhen an OPV is successful, and the Medicare Card No. has been validated, click OK to close the notification return to the booking form.\nWhen an OPV request fails, and the data submitted cannot be validated by Medicare, click OK to close the notification and return to the booking form. Check the patient's First Name, Last Name, DOB and Medicare No. before submitting another OPV request.\nIf you want to update the patient's details right-away, you can open their record from the booking form. To do this, click More to reveal a drop-down list, and click Open Patient.\nDVA Online Veterans Verification (OVV)\n\nSubmitting an OVV request for each-and-every patient that has a DVA card is very important. By verifying that your patient information matches the patient's identity within the Medicare DVA database ensures that DVA claims will be processed smoothly and without delay.\nMediRecords will automatically detect whether or not a patient has a DVA card when your run an OPV against the patient's Medicare card. If the patient also has a DVA card, the DVA number will be automatically be populated to the DVA card field in the Pension / HCC section of the form.\nA patient's DVA details must be verified before you can submit a claim for services under this benefits scheme. To see when a patient's DVA details were last verified, hover your mouse over the i icon next to the OVV button.\nAfter a second or two, their last verification status will pop-out to the left or right. Medicare uses Online Veterans Verification to verify a patient's DVA details.\nTo run an OVV check, click OVV.\nMediRecords will send details of the patient's DVA card no., address and date of birth to be verified with Medicare. If the details are correct, Medicare will send a notification advising the details are correct.\nClick OK to close the notification.\nIf the details do not match the information recorded at Medicare, they will send a notification advising that the details not match, and verification has failed. Click OK to close the notification. At this point, you should advise the patient to contact the Dept. of Veterans Affairs and update their details.\n  Waiting Room\nWhen a patient's appointment status is set to Waiting Room, this will also run an OPV check on their file.\nChecking their patient file will reflect this.\n*NOTE: Each time an OPV check is run, an OVV and PVF (Private Health Insurance check) will also be run.\n  Need help?\n1300 103 903\nsupport@medirecords.com"}