{"title": "Your MediRecords Home Page - The Dashboard", "body": "The Home page - where they are pulling information from, where it will lead you if click on them, and the additional actions that can be performed from within the dashboard.\n\nThe MediRecords Dashboard displays live, up-to-date information, contained within a set of widgets. The widgets give you an at-a-glance snapshot of important activities happening at your clinic. There is a Clock & Weather widget, as well as widgets relating to Appointments, the Waiting Room, Consultations, Lab Results, Overdue Activities, and Services.\nThe information displayed on the widgets can be filtered, allowing you to choose which users' information is displayed on the dashboard.\n\nThe User Filter\nThe User Filter is located next to your Username on the Dashboard. By default, the Dashboard only displays information relative to you.\n\nThe User Filter is a drop-drop list located in the Down Arrow next to your username.\nClick the Down Arrow to reveal the list of users and click the Name of the Users you want to add to the Dashboard.\n\nIf you choose to, you can remove your own name from the dashboard view. This is useful when you are managing only a selected number of clinicians in a much larger practice.\n\nOnce a user has been added, information about their Appointments, Waiting Room, Consultations, Inbox, Overdue Activities, and Services are updated live on your dashboard.\n\nClock & Weather Widget\nThe Clock & Weather widget displays the date, time, and weather relative to the location of the practice.\nThe information displayed on this widget is relative to your location, and it cannot be changed or manually updated.\n\nAppointments\nThe Appointments widget is a live view of the number of pending appointments for your selected users on that day. As patients complete their appointments, the number of pending appointments will reduce. The appointment counter is based on appointments for the current day, and it will refresh and sync with your appointments calendar at the beginning of each day.\n\nWaiting Room\nThe Waiting Room widget is a live view of the number of patients in the waiting room for your selected users on that day. As patients leave the waiting to go into consultation, the number will reduce, and as more patients arrive, the number will increase. \n  Lab Results\nThe Lab Results widget is a live view of the number of patient lab results in your selected user's Inbox. The lab results in the counter do not restart each day - it is a direct reflection of how many patient results have arrived that have not yet been actioned, regardless of when they arrived. The lab results in counter decrease as lab results get assigned to their patient and then increase as more lab results arrive.\n\nClicking it will jump you over to the Inbox page.\n\n\nOverdue Activities\nThe Overdue Activities widget is a live view of the number of overdue activities in the activities calendar for selected users. The overdue activities counter does not restart each day - it is a direct reflection of the number of overdue activities that are assigned to your users. The overdue activities counter decreases as activities get completed and will increase when an activity becomes overdue.\n\nClicking the Widget will jump you over to the Activities page.\n\n\nServices\nThe Services widget is a live view of financial revenue invoices for services on that day. The services counter restarts at the beginning of each day, and increases as patients are invoiced for services.\n\nClicking the Widget will jump you over to the Sales page.\n\n\nIf you would like to know more about the Sales Dashboard, then please click here: Sales Dashboard"}