{"title": "Default Security Privileges - Guest", "body": "In MediRecords, the user Security Privileges are dictated by the Security Roles, which are dependent on your subscription plan. While these come with preset options, you have the ability to reduce or increase permissions.\nIn this article will show the Default Security Privileges of Guest found within the Security Privileges of Settings.\nFor more information about Managing Security Privileges, please refer to our article here.\nAccount - Relates to Accounts Payable, Expenses, Expense Journal, and Assignments.\nFor more information about Security Privileges - Accounts, please refer to our article here.\n\n\nAppointments - Relates to Appointments, Consulting Rooms, Sessions (opening hours), and Holidays.\nFor more information about Security Privileges - Appointments , please refer to our article click here.\nBilling - Relates to Accounts Receivable, Payments, Invoices, Bulk Billing Claims and Reports, and Adjustments.\nFor more information about Security Privileges - Billing, please refer to our article here.\nClinical - Relates to Clinical Data, including Allergies, Immunisations, Demographics, Hospitalisations, Pregnancies, and other Medical History.\nFor more information about Security Privileges - Clinical, please refer to our article here.\nPatients - Relates to Patient Records, including creating New Patients, Alcohol / Smoking Status, Family History, and Social Habits\nFor more information about Security Privileges - Patients, please refer to our article here.\nResources - Relates to Contacts, Service Providers, Sub-specialities, Drug Recipes, Clinical Templates and Drawings, Patient Education, and Letter Templates.\nFor more information about Security Privileges - Resources , please refer to our article here.\nSettings - Relates to Bank Accounts, Auditing, Item Schedules, Notice Board Settings, and Security Roles\nFor more information about Security Privileges - Settings , please refer to our article here.\nSubscription - Relates to Practices, Users, MediRecords Modules, Biographies, and Qualification\n\nReporting - Hides the reporting section if Role Execute Report is allowed\n\n  The Importance of Security Roles & How to Setup.\n  If you need further assistance please contact support on 1300 103 903 or email at support@medirecords.com"}