{"title": "What are patient demographics?", "body": "Patient demographics typically relate to the patient's age, gender, nationality, habits, lifestyle choices, and family medical history. In MediRecords, patient demographics are divided into five separate categories:\nDemographics\nSocial\nTobacco\nAlcohol\nFamily History\nThe records for each of these sections are contained within the \"Details Tab\" of a patient's record.\nN.B OTHER entered in the Gender field will cause issues when e-Prescribing, enter Male or Female\n  Patient Record> Details > Demographics \nThere are five core demographic fields: : \nFirst Name \nSurname \ngender\ndate of birth \nMedicare/DVA \nThere are also primary address details > Secondary > Emergency > Referral details  (that allows Interested parties to be included in any correspondence ), so any clinical investigations can be shared across a whole Care Plan of Interested parties or specialist \nPatient Record> Details >Social \nRecord the following Patient details in the section social\nHome\nCarer or Guardian \nWork\nReligion \nLifestyle \nEducation \nNotes \nPatients Records > Details > Tobacco \nRecord the patient's smoking history, this will be displayed on the patient's profile \nIf the patient has been assessed, an Icon will display in Red if a smoker and Green if a nonsmoker.\nOnce the patient has been assessed enter the date the assessment was completed then select save.\nPatients Records > Details > Alcohol\nRecord the patient's relationship with Alcohol, this will be recorded on the patient's profile as a Martini glass. \nThe red patient was recorded as a drinker and the Green was recorded as a Nondrinker. \nPatients Records > Details > Family History \nRecord the patient's family history with the following fields \nMother \nFather Alive OR Deceased \nFamily History Details \nPatient Record> Details >Settings \nThe settings in the patient details is a high priority, to ensure details are correct for prescribing and E-prescribing. \nFill in the following patient details \nAccount Payer \nFirst Name on Medicare card \nSurname Alias \nMedicare address\nMedicare Card No:\nMedicare Expiry\nPension card details\nDVA card details \nSafety net Card details\nHealth Identifier IHI No: (Patient identifier)\nIHI Record Status \ne-Prescribing\nPrivate Health Insurance details \nYou can also conduct an OPV check here to validate patients' Medicare card details. \n  N.B. PVF check to validate Private Health Insurance \nValidate IHI for e-prescribing\nFollow the below link for more Knowledge base articles on this topic \n Patients Details"}