{"title": "Managing your Existing Patient Education Templates", "body": "Managing your Existing Patient Education Templates\n  MediRecords has a growing database of Patient Education material sourced from Sonoa Health and the NPS. Fact sheets on common questions such as Malaria information, Smoking Cessation, and Pelvic Floor Muscles are already available for you in the MediRecords Community.\nThis tutorial will show you how to manage your existing templates.\n\nNavigate to More and select Resources.\n\n\n\nWithin Resources, select Patient Education.\n\n\n\nYou will be brought to the Patient Education screen.\n\n\n\nWhen you click the checkbox next to at least one resource, a series of options will show at the top.\n\nPreview\n\nThis allows you to see a quick overview of the resource. To do this, check the box and click Preview.\n\n\n\nThis will pull up the preview of the resource in a new tab or window (depending on your browser settings).\n\nAlternatively, you can click on the name of the resource.\n\n\n\nFilter\n\nThe Patient Education section has a filter function for you to customise your view of the resources.\n\n\n\nTo filter the list of Patient Education resources, click Filter to reveal a drop-down list, and select a filter under the headings of Scope, Status, or Publisher. In this example we will click the following:\n\n\n\nThe following result is produced:\n\nSearch\n\nTo Search for a Patient Education resource, click the Search box and type in a search term. Click the search icon to complete. Alternatively, you can press Enter or Return on your keyboard.\n\n\n\nDepending on your search term, results that match it by Name will be shown.\n\nEdit\n\nYou can only edit resources that you have created. To edit a Patient Education resource, check the box next to it and click Edit.\n\n\n\nYou will be greeted with the Edit PE form.\n\n\n\nYou can make adjustments ranging from changing the name and share level, to uploading a new file in place. Click Save when you have finished.\n\nDeactivate/Reactivate\n\nTo deactivate the status of one (or multiple) Patient Education resources, check the box(s) next to the resource. Click status and select Deactivate.\n\n\n\nThe resource will now be Inactive and won't appear among the list of Active resources.\n\nTo reactivate a resource, click the Filter and select the options so that it will show Inactive resources only, as shown.\n\n\n\nCheck the box next to the Inactive resource, click Status and select Activate.\n\n\n\nYour Inactive resource will now be Active again for use.\n\nPrint\n\nTo print a resource, check the box next to it and click More. Select the Print option.\n\n\n\nFollow your browser prompts to print the resource. \n\nDelete\n\n*NOTE: You can only delete patient education resources that you create. Note that this is a permanent action and cannot be reversed.\n\nTo delete a resource, check the box and click More. Select the Delete option.\n\n\n\nYou will be greeted with a warning prompt, as this action is permanent. Click Yes to acknowledge that the resource will be deleted.\n\n\n\nThe resource has now been deleted.\n\nTo learn more about how to Add New Patient Education click here."}