{"source": "https://support.medirecords.com/hc/en-us/articles/360000792976-What-is-Screen-Sharing-and-why-would-I-be-asked-to-join-a-session", "title": "What is Screen-Sharing and why would I be asked to join a session?", "body": "MediRecords Screen-Sharing\nMediRecords Co-Browse is a safe and secure way for MediRecords to support you through the various workflows both clinical and administrative for troubleshooting purposes.\nThrough Upscope, MediRecords (MR) can support direct screen sharing with you, without the need for you or your business to download third party software, such as Team viewer. So, how does it work?\nGetting Started\nFor Co-Browse to work, ensure you:\nLogged into your MediRecords account with your own unique set of credentials\nProvide support with your full name and suitable time to connect\nBe in front of your MediRecords account at the agreed co-browse time\nHow does it work?\nAt the agreed time, a MediRecords support agent will send you a co-browse request that will appear on your MediRecords screen.\nStep 1. MediRecords support will send you a request to connect (Note: Co-Browse session will not begin without the expressed authority of the user).\nStep 2. A pop up will appear on your MR screen, awaiting your response:\nStep 3. If you selected Yes to enable the Co-Browse, the session will begin immediately.\nIf the Co-Browse session was declined, a new request will need to be sent. Please contact support to arrange a suitable time.\n  What does Screen-Sharing show MediRecords?\nMediRecords Co-Browse only shares MediRecords screens. Your web address bar, bookmarks, station desktop, tabs, web pages and other files will not be visible to MediRecords. Should you move away from a MediRecords web page, the MediRecords support agent will not be able to follow:\nMediRecords support agent screen:\nYour screen:\n    How much control will MediRecords have over my screen during Screen-Share?\nAgain, MediRecords will not have access to your other tabs, web pages, station desktop screen AND, should you navigate away from a MediRecords screen, the agent will not be able to follow.\nMediRecords will not have access type into any text fields in your MediRecords account e.g Patient search, new letters, patient details. The agent will be able to:\n1. \nHighlight an area on your MediRecords screen\n2.\nDraw temporary arrows and write \"handwritten\" instructions that will appear briefly on your screen as required\n      As you are always in control, you can end session at any time by selecting END SESSION located in the bottom left corner of your screen.\nOnce the session has ended you will receive a pop-up notification to confirm the session has ended, just like the one below:\n  You've completed another MediRecords Tutorial. You should now understand, be able to arrange and participate in a MediRecords Co-Browse session. If this is not what you're looking for, head back to our knowledge base and search for another article.\nFor further assistance, please contact MediRecords support on 1300 103 903 during business hours or email support@medirecords.com\n     "}