{"source": "https://support.medirecords.com/hc/en-us/articles/7996587252239-MediRecords-Basic-Navigation", "title": "MediRecords Basic Navigation", "body": "MediRecords Basics\n  Header Bar\nThe header bar across MediRecords ensures its presence on every page visited by the user.\nThis bar contains the MediRecords logo, allowing users to easily switch between various practices. Additionally, it features Quick Actions, providing swift access to functions such as patient record creation, appointment scheduling, clinical actions, and tasks management from any page within the platform.\nWithin this header, you'll also find icons that serve as shortcuts to key sections, including the Messaging Centre (comprising the Inbox and Outbox for Secure Messaging), Activities (Clinical Actions, Tasks and Worklist), and the Person Icon for user access to Preferences, Profile and the MediRecords Knowledge Base. Furthermore, the bar includes a Find Patient search bar, facilitating a quick search for existing patient records.\n  Navigation Menu\nThe Navigation Menu encompasses essential features available within MediRecords. This menu bar can be minimised to maximise screen space during navigation. It offers direct access to various sections, including the Home Page, Appointments, Waiting Room, Patients, Accounts (for comprehensive financial management), and More, which includes Resources, Settings, Reporting, Audit, and Utilities.\n  Home\nWelcome to the Home page, where users can gain a comprehensive view of their daily activities.\nHere, users can access a dropdown menu that enables them to switch to another user's information. The page displays essential information, including the current date and time for the selected user.\nFurthermore, it presents the Appointment Calendar, providing insight into the user's scheduled appointments for the day, the count of patients currently in the Waiting Room, the number of consultations completed, any received results via Secure Messaging in their Provider Inbox, outstanding activities requiring attention, and the total value of services billed for the day.\nAdditionally, users have the option to explore the MediRecords Knowledge Base, check the\nService Status and access our exclusive MediRecords blog.\n  Communications Bar\nLocated on the right-hand side is the Communication Bar, comprising a Chat function for seamless real-time conversations between users or user groups. It also houses the Notice Board, a platform for Practice wide communication. Furthermore, the Email on Demand feature is readily accessible to users, allowing them to send emails to patients and contacts promptly, regardless of the screen they are currently working on.\n\nAppointments\nWithin the Appointments screen, you'll find a time-incremented calendar displaying a provider's appointments for the day. The Providers dropdown allows users to select multiple providers. Depending on the selection, the calendar can be viewed either in a one-day view for multiple providers or a week view for a single provider. Additionally, there's an agenda function that presents a list view for all provider appointments over the week. The List function offers a comprehensive view of appointments across multiple practices. Above the calendar, a Search bar is available for patient look-up, enabling users to access their past and upcoming appointments. Users can also opt to display appointment tiles color-coded based on either appointment type or status, with the corresponding colours explained in a legend below.\nThe calendar provides filtering options for urgent statuses, patient type, room allocation, and appointment status. Furthermore, the SMS credit balance is prominently displayed above the calendar for quick reference.\nAppointments can be created by the New Appointment button or by double clicking into a slot on the calendar. The patient’s name is searched, and details of the appointment saved. The appointment then appears as a tile on the calendar.\n  Waiting Room\nThe Waiting Room offers real-time visibility into appointments in specific statuses: Waiting Room, With Provider, and At Billing. Multiple providers' activity can be displayed by using the Filters button.\nPatients can be added to the Waiting Room through the Appointments button, which lists today's appointments. You can also create impromptu Walk-In appointments, including the option to generate new patient records. Appointments can be managed by dragging and dropping them between columns or by clicking for additional options.\nOnce a patient is in the Waiting Room, both doctors and receptionists can transition the appointment to the next stage. Clicking on a tile provides options to edit appointment details, view patient information, cancel appointments, or advance them to the next stage.\nThis page updates in real time on all users' screens, enabling doctors to know when patients have arrived. Doctors can open patient files and start consultations by clicking on tiles in the With Provider column. Clicking the Finish button in the patient's file automatically moves the tile to At Billing. If no billing is required, users can mark it as Completed without billing.\nIn the At Billing stage, receptionists can create invoices by clicking on the tile and also\nschedule new appointments if necessary. Once an invoice is generated, the appointment status changes to Completed and is automatically removed from the screen.\n  Patients\nThe patient's page, often called the patient grid or table, displays a list of all patient records within the Tenant (account), primarily showing active accounts. Users can access inactive accounts and apply various filters, like Usual Practice or Usual Provider, using the Filter option.\nThe search bar allows users to find patients by name, phone, address, or even Medicare number. Typically, the list defaults to display the most recently created or updated records at the top.\nUsers can create customised views to filter patients based on specific criteria, such as patients with upcoming appointments or those with peanut allergies. To add a new patient record, users can click the New Patient button, opening a blank record for completion. Essential details like the patient's title, first and last name, date of birth, address, and preferred contact method must be provided to create the record.\n  Accounts\nThe Accounts tab holds many areas, such as:\nSales- This section displays all outstanding invoices and offers detailed filtering and\nsearch options for parameters like payor, date range, invoice age, provider, and more.\nAdditionally, the \"Details\" button in the top right can be used to search for all invoices,\nregardless of their status. \nExpenses – is where users can record any expenses within the practice.\nDistributions – This function is employed to monitor the allocation of services among providers. For instance, in cases where two providers collaborated, resulting in a single invoice that has been paid, this feature allows them to generate a secondary invoice linked to the initial one.\nJournal- The Journal serves as a daily record of financial transactions, encompassing both inflows and outflows. These transactions are automatically generated when payments and adjustments occur but can also be manually created using the \"Add Journal\" button.\nReconciliation– It is utilised for reconciling actual balances (EFT, cash, etc.) with the recorded data in MediRecords.\nAIR Claiming – AIR, or the Australian Immunisation Register, is a platform within MediRecords used to transmit vaccination records to the register. This service is responsible for updating a patient's immunisation status with Services Australia.\nClaiming – This is the section where any invoice being electronically transmitted to Medicare, DVA, or a health fund undergoes processing. Invoices can be filtered by their status, such as Unclaimed (not yet transmitted), In Progress, and Completed. Additionally, this section includes a \"Details\" button for conducting more comprehensive system-wide searches. \nMore\nThe \"More\" tab encompasses various miscellaneous areas, including:\nResources- Within this section, you'll find system templates and contacts, encompassing Letter Templates, Drug Recipes, Service Provider contacts, and Health Professional contacts used for Correspondence. These resources also contain Community-shared templates provided and managed by MediRecords, such as investigation requests, standard referrals, and invoice templates. Additionally, users have the flexibility to create and maintain their own templates and resources.\nSettings – This section serves as the configuration hub for practice and user preferences. It includes settings for default options, Appointment Sessions and Types, security privileges, and SMS templates. Additionally, it's the place for creating new user accounts or secondary practices and activating integrations with third-party services. \nReporting – MediRecords offers a diverse range of reports to help users gain a comprehensive understanding of their practice. These reports cover aspects such as patient demographics, appointment statistics, and financial activity, providing valuable insights into practice operations.\nAudit – The Audit Log serves as a continuous record of activity within the system, capturing timestamps for user logins and logouts, as well as tracking the deletion of scripts or letters and patient records. The Integration Audit, on the other hand, records incoming Secure Messages and eRx transactions, providing a detailed account of integration-related activities."}