{"source": "https://support.medirecords.com/hc/en-us/articles/5942360564367-Common-IHI-Errors", "title": "Common IHI Errors", "body": "This article will explore some of the common errors you can receive when you are trying to validate a patient's IHI number.\n*NOTE: This list is not exhaustive. \n  Patients Gender Error\n  \"No enum constant au.net.electronichealth.ns.hi.xsd.common.commoncoredatatypes._3.SexType.U\"\nIf you receive this error when trying to validate an IHI number, it could be due to the patient not having the correct gender selected that Medicare or the HI Services have on their records. \n  IHI Validation Failure: '01439'(Information) No Healthcare individual records have been found'\nValidating the individual healthcare identifier (the ‘IHI’) and accessing the My Health\nRecord System possesses a higher level of security than an OPV (Online Patient Verification)\ncheck for Medicare. As such, it is essential that the organisation has the most accurate\nand up-to-date patient demographic information, because without that information an\nIHI may not be validated.\n\nPatients can call the Healthcare Identifiers Service on 1300 361 457 Monday to Friday 8:30 am to 5 pm AEST to check their details against what they have provided the Practice.\nWhy is my patient's IHI number disappearing?\nIf you are attempting to validate a patient's IHI number or save the IHI number to their record, and it disappears, this is due to the IHI validation not being successful according to the Health Identifier Service.\nMediRecords will send a payload to the HI Services that contains patient information.\nIt looks like this:\n\n\"lastName\":\"Smith\", Patient's last name\n\"gender\":\"M\", Patient's Gender\n\"ihiNumber\":\"8003607330180789\", IHI Number\n\"dob\":\"15032000\", Date of Birth\n\"certificateAliasName\":\"subject cn=general.8003624485707130.id.electronichealth.net.au, sn(hex)=152c0, usage=encrypt, expiry=20240615\", NASH Certificate info\nIf the HI Service can match the supplied IHI number to the Patient name, gender and DOB, we will receive this response from the HI Service and the number will remain in the field:\n\n\"ihiNumber\":\"http://ns.electronichealth.net.au/id/hi/ihi/1.0/8003607330180789\",\n\"numberStatus\":\"Active\",\n\"recordStatus\":\"Verified\",\n\"exception\":null,\n\"timeStamp\":\"2022-12-17T13:30:56.564+11:00\"\nThe Statuses will change to Active and Verified.\nIf the HI Service cannot match the supplied IHI number to the Patient name, gender and DOB, we will receive this response and the number will be automatically removed:\n\n\"exception\":{\n\"code\":\"01439\",\n\"description\":\"(INFORMATION) No Healthcare Individual records have been found.\"\n},\n\"timeStamp\":\"2022-12-16T21:42:06.496+11:00\",\nAnd if you hover over the 'i' after the number disappears, you will see the response from HI.\nDue to the fact that the HI Service is telling the system that this number does not belong to this person, the IHI number is automatically removed to prevent any mistaken or illegal prescribing to an incorrect patient, as well as keeping the IHI number owner's My Health Record safe from being accessed by an unconsented provider.\nIf you are having further issues with a patients IHI number, you can advise the patient to contact Health Identifier Services to verify their information on 1300 361 457. \n "}