{"source": "https://support.medirecords.com/hc/en-us/articles/4620726835087-How-to-update-your-NASH-certificate-from-SHA-1-to-SHA-2", "title": "How to update your NASH certificate from SHA-1 to SHA-2?", "body": "  MediRecords is SHA-2 Ready\nSometimes you need to update your certificates in MediRecords that are used to access your integrations i.e. My Health Record. This guide is going to walk you through how to update your MediRecords NASH certificates, these certificates relate to My Health Record access and E-Prescribing for patients. \nRevoking the SHA-1 certificate\nLogin to your PRODA account\nSelect Go to service on the HPOS tile. \nYou may need to complete the linking process to proceed.\nProceed as individual only.\nSelect My programs.\nSelect Healthcare Identifiers and My Health Record.\nSelect Healthcare Identifiers - Manage existing records.\nSelect My organisation details.\nNote: If connected to multiple organisations you will first need to select the required organisation record.\nSelect the Certificates tab. \nUnder the Action columns click the Revoke hyperlink next to the NASH SHA-1 certificate you wish to revoke.\nYou should get a warning notification. To continue read the notification and click OK.\nComplete the form and select your reason for revocation as ‘transitioning to a NASH SHA-2 Certificate’.\nTick the Terms and Conditions box and click Save changes.\nClick the Submit button.\nObtaining a SHA-2 certificate: \nPlease note that your previous SHA-1 certificate will need to be revoked prior to requesting a SHA-2\nLogin to your PRODA account\nSelect Go to service on the HPOS tile.\nYou may need to complete the linking process to proceed.\nProceed as individual only\nSelect My programs. \nSelect Healthcare Identifiers and My Health Record tile.\nSelect Healthcare Identifiers - Manage existing records. \nSelect My organisation details.\nNote: If connected to multiple organisations you will first need to select the required organisation record.\nSelect the Certificates tab. \nIf your certificate has not expired click Renew, otherwise select Request a NASH PKI certificate from the task list.\nSelect your software product version from the first drop down list. This list contains software product versions that are SHA-2 ready. If you cannot locate your software from the drop down list, please select the most appropriate reason from the second drop down list:\nSelect MediRecords or\nI wish to select my SHA level explicitly: and choose SHA-2 (MediRecords is SHA-2 ready)\nEnter a mobile number. When the certificate is ready to download you will receive a text message to the mobile number provided.\nTick the check box to confirm you have read and understood the terms and conditions. \nSave changes and submit.\nOnce you have received a text message, your certificate is ready to download. Log into HPOS to download the certificate. The PIC is used during the installing of the certificate.\nDownload the file onto your computer in an easy to find spot. \nUploading the NASH certificate: \nIn MediRecords, navigate to More > Settings > Configurations Settings\nSelect Practice Name > Health Identifiers to connect with the Health Identifier Service for IHI and My Health Record.\nEnter in the unique PIC then click Select File and navigate to where you saved your certificate locally on your machine and select it.\nSelect Save.\nYou should get a blue box saying this certificate was updated successfully. If you receive an error that says, 'PIC does not match certificate', please refer back to PRODA to confirm the PIC.\nRepeat step 1-3 in the eHealth section to enable e-Prescribing.\nSelect Save."}