{"source": "https://support.medirecords.com/hc/en-us/articles/360000579775-Expanded-Clinical-View", "title": "Expanded Clinical View", "body": "The Expanded Clinical View provides Clinicians immediate access to key patient information without moving away from the days consult notes.\nThe Expanded Clinical View is a dedicated window for conducting clinical consults, allowing for even greater access to patient information as you type your notes. \nThe Expanded View can be accessed from the Patient's Clinical Record, in the Today's Notes tab.\nTo open this view, first select the Expander Icon in the top right corner of your standard consult screen.\nOnce selected, the menu on left side of the Clinical tab will disappear, and the Today's Notes window will be expanded with additional space and features. \nFrom the Expanded View, you have access to the following additional features when conducting a consultation:\nActivities Alert Box\nThis box will alert clinicians to any outstanding Tasks or Clinical Actions, such as a Reminders and Recalls. This box will appear next to the Allergies & Reactions Alert Box. \nOverdue Tasks and Clinical Actions will appear in RED text.\nAll activities visible from this box are sorted by Due Date, Oldest to Newest. Only the activities Type  and Subject will be displayed. \nLike Allergies & Reactions, a New Task or Clinical Action can be created directly from the Alert Box. Click the + Sign and select either Task or clinical Action. \nDepending on your selection, either the Task or Clinical Action pop up will appear.\nYou can edit or add commentary to Task or Clinical Action by selecting the activities Type which is displayed in BOLD.\n  Summary View\nThis Summary View, located to the right hand side of the Clinical Consult Expanded View, effectively replaces the standard menu on the left hand side of Today's Notes.\nUnlike the standard menu, Clinicians won't have to navigate away from their consult notes for today when viewing historical information.\nThe Summary View, provides quick access to a patients clinical information:\nCurrent Medical History\nPast Consultations\nCurrent Medications\nImmunisations\nProcedures*\nLatest Results\nLatest Correspondence\nObstetrics*\nNOTE: Items marked with an asterisk will only be visible as selectable options where clinically relevant. E.g Obstetrics will only be visible for female patients with a current or past pregnancy.\nClick on the name of a module to reveal a drop-down view of all available information of that type.\nNOTE: Only one view may be selected at any given time. E.g If Current Medical History is open and you select Past Consultations, Current Medical history will be minimised and Past Consultations will be expanded. If there are more than 10 (Ten) items to display, additional pages will be created which can be viewed by selecting the left or right arrows or available page numbers, which are also hyperlinked.\nSelected modules are easily identified as the modules title will be displayed in Blue.\nWhere applicable, you will be able to select the Date or Name of a record to view additional information. Applicable items can be identified by a Blue Hyperlink. Once selected, you will also be able to edit an item where applicable.\n  Activity View\nIn addition to the Activities Alert box, you can view all Future, Current/ Overdue and Completed Tasks & Clinical Actions.\nTo open the Activity View select the Summary View drop-down in the top right corner of the Expanded Clinical View. Once selected, a drop down will appear with the option to select the Activity View.\nOnce selected, new menu items will appear, segregating the patients Tasks or Clinical actions based on 3 (Three) categories:\nOverdue\nDue in the next 6 months\nCompleted\nAs with the Summary View, the Activity View's modules can only be selected one at a time, open modules will be identified as the modules title will become blue and, If there are more than 10 (Ten) items to display, additional pages will be created which can be viewed by selecting the left or right arrows or available page numbers, which are also hyperlinked.\nAdditional Clinical Activities \nFrom the Expanded View, additional actions and clinical activities can be performed in addition to the options available in the Today's Notes screen.\nClick the More to reveal a drop-down list, and select the Activity you wish to perform, such as Print Full Patient Report or Add New Result. \nThe activity will be carried out and a new record will be added to the Patient Clinical Record under it's respective tab.\nOnce you've finished using the Expanded View, you can Finish the Consult by clicking Finish, or click the Expansion Icon to return to the standard Today's Notes screen.\n*NOTE: All changes made to Today's Notes will be kept when changing from the Expanded View to the Today's Notes screen.\n  You've completed another MediRecords Tutorial. If this is not what you're looking for, head back to our knowledge base and search for another article.\nFor urgent assistance, please contact MediRecords support on 1300 103 903 during business hours."}