{"source": "https://support.medirecords.com/hc/en-us/articles/360000723696-Auto-save-Pop-up-Alerts", "title": "Auto save & Pop-up Alerts", "body": "Auto Save & Pop-up Alerts \nAuto save and pop-up alerts are produced by MediRecords to ensure all your clinical notes and letters are saved before you navigate away from or close a patient record.\n  Consult Notes\nNotes are saved automatically without having to manually press Save on your consult notes. Our pop up alert exists as a back up to this feature, ensuring all notes have been stored against the patient record.\nThese features are outlined below:\nThe first is the Auto-Save function, which will automatically save any data entered into the form.\n  Naturally, you can also save notes by clicking the Save button below:\n  An alert will appear if the notes have not fully saved before selecting Finish or when attempting to close the patient record by selecting the 'x' to the right of the patient tab.\nSelect Finish\n    Attempt to close the patient tab\n    The pop-up in either scenario will appear stating 'Changes not saved. Select Continue to proceed without saving or Cancel to review changes'. To retain your information, please ensure you select the Cancel option, wait a moment and re-attempt Finish or close/ navigate away from the patient tab.\n  NOTE: If a patient file becomes greyed out it's because the page has not fully loaded. You may be familiar with this feature if you use social media sites or linked in, where a silhouette of a page is displayed in lieu of the actual page if it has not successfully loaded.\n    Letter Templates\nBoth the auto save and pop up alerts are available when writing or amending a letter within the patient record.\nAs with your consult notes, the pop-up alert will appear when you attempt to close the letter before all changes have been saved:\n  You've completed another MediRecords Tutorial. You should now be able to save and finalise a consultation. If this is not what you're looking for, head back to our knowledge base and search for another article.\nFor urgent assistance, please contact MediRecords support on 1300 103 903 during business hours."}