{"source": "https://support.medirecords.com/hc/en-us/articles/8769905667727-How-to-Find-Add-Patient-in-Admissions", "title": "How to Find/Add Patient in Admissions?", "body": "Introduction:\nAdmitting a patient is a crucial step in the healthcare process that involves the formal entry of an individual into a hospital or healthcare facility for inpatient care. The Admissions module plays a pivotal role in this process, facilitating the smooth transition of a patient's first contact through to discharge.\nTo Access the admissions module - Navigate to the Menu Bar at the left side of the screen.\nAdd Patient -\nThe first step in admitting a patient involves capturing essential demographic information, such as name, age, address, contact details, and insurance information. This step ensures accurate identification and establishes a foundation for the patient's record. You need to have added a patient before you can admit them under Admissions.\nOur Admissions Module is located in our menu bar under patients.\nTo add a new patient to the system select the from the shortcuts menu in MediRecords or New Patient from the patient grid.\nTo add a New patient follow this helpful link - How to add New Patient\nSearch Patient -\n Under \"Admissions,\" locate and select the \"FIND/ADD PATIENT\" option.\nTo find a specific patient, enter the patient's name in the provided search bar.\nSelect the \"Search\" option to initiate the search process.\nThe system will generate a search grid displaying relevant patient matches based on the entered name.\nOnce you've located the correct patient in the search grid, select the patient's entry.\nLook for the \"plus\" icon this is the option to add the patient to the Admissions module.\nYou will now be presented with the Admission type.\n  You then need to complete the registration form. It will default to what ever choice you made from planned, urgent, or emergency in the last step. For this example, we will use planned.\nSelect Planned > Registration form will populate > all fields marked with Red asterisk are mandatory.\nReason for presentation ( these reasons are hard coded free text is not enabled ) *\nAttending Provider\nFacility *\nAdmission Date and Time *\nRoom and Bed number\nSave\nOnce saved presented with a prompt Create Encounter for the Patient \nThe patient has now been admitted as a planned admission.\n      Need help?\n1300 103 903\nsupport@medirecords.com\n               "}