{"source": "https://support.medirecords.com/hc/en-us/articles/6327005617423-How-do-I-Audit-Invoice-and-Claiming-Activity", "title": "How do I Audit Invoice and Claiming Activity?", "body": "How do I Audit Invoice and Claiming Activity?\nThe process that are audited in the account tab in a patients record are - \nQuotes\nInvoices\npayments \nAdjustments \nHover your mouse over the lock icon located at the end of the grid, for either a quote, invoice, payment or adjustment entry to see the \"created by\" and last \"updated by\".\nClaiming activity can be audited at each step of the claiming process, by hovering over lock icon for the following\nUnclaimed invoice\nInvoice progress claim \nclaim completed this week\nYou can see the 'created by' and last 'Updated by' details (User and timestamp). \nThe information shown depends on which stage of the claiming process the invoice or claim is at:\nFor invoices under the Unclaimed Amount donut:\nThe \"Created By\" information is generated by the user who created the invoice with type Medicare/DVA/IMC/PCI, MediRecords will automatically move the invoice to Unclaimed Amount category after saving an invoice.\nThe \"Updated By\" information is generated from any changes or modifications made to the invoice by any user before the submitting process has begun. \nFor invoices under the In Progress donut:\nThe \"Created By\" information is generated by the User who created the invoice with type - \nMedicare \nDVA\nIMC\nPCI\nMediRecords will automatically move the invoice to unclaimed amount category after saving an invoice.\nThe 'Updated By' information is generated from any changes or modifications made to the invoice by any user before the submitting process has begun.\nFor invoices under the Claims Completed this Week donut:\nThe \"Created By\" information is based off of the user who clicks on the \"Process\" button or accepts the claim once its paid by Medicare.\n  In the case that the practice is configured to automatically process Medicare Claims, automatically processed Medicare Claims will display that they are Created by \"Dr MediRecords System\"\nIf you're interested in learning more about the Auditing function click here\nPatient Audit\n  If you need further assistance please contact support on 1300 103 903 or email at support@medirecords.com"}